MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
extern volatile CLCIN6PPSbits_t CLCIN6PPSbits __at(0xE25);
// bitfield macros
#define _CLCIN6PPS_PIN_POSN                                 0x0
#define _CLCIN6PPS_PIN_POSITION                             0x0
#define _CLCIN6PPS_PIN_SIZE                                 0x3
#define _CLCIN6PPS_PIN_LENGTH                               0x3
#define _CLCIN6PPS_PIN_MASK                                 0x7
#define _CLCIN6PPS_PORT_POSN                                0x3
#define _CLCIN6PPS_PORT_POSITION                            0x3
#define _CLCIN6PPS_PORT_SIZE                                0x2
#define _CLCIN6PPS_PORT_LENGTH                              0x2
#define _CLCIN6PPS_PORT_MASK                                0x18
#define _CLCIN6PPS_CLCIN6PPS0_POSN                          0x0
#define _CLCIN6PPS_CLCIN6PPS0_POSITION                      0x0
#define _CLCIN6PPS_CLCIN6PPS0_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS0_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS0_MASK                          0x1
#define _CLCIN6PPS_CLCIN6PPS1_POSN                          0x1
#define _CLCIN6PPS_CLCIN6PPS1_POSITION                      0x1
#define _CLCIN6PPS_CLCIN6PPS1_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS1_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS1_MASK                          0x2
#define _CLCIN6PPS_CLCIN6PPS2_POSN                          0x2
#define _CLCIN6PPS_CLCIN6PPS2_POSITION                      0x2
#define _CLCIN6PPS_CLCIN6PPS2_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS2_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS2_MASK                          0x4
#define _CLCIN6PPS_CLCIN6PPS3_POSN                          0x3
#define _CLCIN6PPS_CLCIN6PPS3_POSITION                      0x3
#define _CLCIN6PPS_CLCIN6PPS3_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS3_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS3_MASK                          0x8
#define _CLCIN6PPS_CLCIN6PPS4_POSN                          0x4
#define _CLCIN6PPS_CLCIN6PPS4_POSITION                      0x4
#define _CLCIN6PPS_CLCIN6PPS4_SIZE                          0x1
#define _CLCIN6PPS_CLCIN6PPS4_LENGTH                        0x1
#define _CLCIN6PPS_CLCIN6PPS4_MASK                          0x10
#define _CLCIN6PPS_CLCIN6PPS_POSN                           0x0
#define _CLCIN6PPS_CLCIN6PPS_POSITION                       0x0
#define _CLCIN6PPS_CLCIN6PPS_SIZE                           0x5
#define _CLCIN6PPS_CLCIN6PPS_LENGTH                         0x5
#define _CLCIN6PPS_CLCIN6PPS_MASK                           0x1F

// Register: CLCIN7PPS
#define CLCIN7PPS CLCIN7PPS
extern volatile unsigned char           CLCIN7PPS           __at(0xE26);
#ifndef _LIB_BUILD
asm("CLCIN7PPS equ 0E26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CLCIN7PPS0             :1;
        unsigned CLCIN7PPS1             :1;
        unsigned CLCIN7PPS2             :1;
        unsigned CLCIN7PPS3             :1;
        unsigned CLCIN7PPS4             :1;
    };
    struct {
        unsigned CLCIN7PPS              :5;
    };
} CLCIN7PPSbits_t;
extern volatile CLCIN7PPSbits_t CLCIN7PPSbits __at(0xE26);
// bitfield macros
#define _CLCIN7PPS_PIN_POSN                                 0x0
#define _CLCIN7PPS_PIN_POSITION                             0x0
#define _CLCIN7PPS_PIN_SIZE                                 0x3
#define _CLCIN7PPS_PIN_LENGTH                               0x3
#define _CLCIN7PPS_PIN_MASK                                 0x7
#define _CLCIN7PPS_PORT_POSN                                0x3
#define _CLCIN7PPS_PORT_POSITION                            0x3
#define _CLCIN7PPS_PORT_SIZE                                0x2
#define _CLCIN7PPS_PORT_LENGTH                              0x2
#define _CLCIN7PPS_PORT_MASK                                0x18
#define _CLCIN7PPS_CLCIN7PPS0_POSN                          0x0
#define _CLCIN7PPS_CLCIN7PPS0_POSITION                      0x0
#define _CLCIN7PPS_CLCIN7PPS0_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS0_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS0_MASK                          0x1
#define _CLCIN7PPS_CLCIN7PPS1_POSN                          0x1
#define _CLCIN7PPS_CLCIN7PPS1_POSITION                      0x1
#define _CLCIN7PPS_CLCIN7PPS1_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS1_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS1_MASK                          0x2
#define _CLCIN7PPS_CLCIN7PPS2_POSN                          0x2
#define _CLCIN7PPS_CLCIN7PPS2_POSITION                      0x2
#define _CLCIN7PPS_CLCIN7PPS2_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS2_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS2_MASK                          0x4
#define _CLCIN7PPS_CLCIN7PPS3_POSN                          0x3
#define _CLCIN7PPS_CLCIN7PPS3_POSITION                      0x3
#define _CLCIN7PPS_CLCIN7PPS3_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS3_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS3_MASK                          0x8
#define _CLCIN7PPS_CLCIN7PPS4_POSN                          0x4
#define _CLCIN7PPS_CLCIN7PPS4_POSITION                      0x4
#define _CLCIN7PPS_CLCIN7PPS4_SIZE                          0x1
#define _CLCIN7PPS_CLCIN7PPS4_LENGTH                        0x1
#define _CLCIN7PPS_CLCIN7PPS4_MASK                          0x10
#define _CLCIN7PPS_CLCIN7PPS_POSN                           0x0
#define _CLCIN7PPS_CLCIN7PPS_POSITION                       0x0
#define _CLCIN7PPS_CLCIN7PPS_SIZE                           0x5
#define _CLCIN7PPS_CLCIN7PPS_LENGTH                         0x5
#define _CLCIN7PPS_CLCIN7PPS_MASK                           0x1F

// Register: CLC1CON
#define CLC1CON CLC1CON
extern volatile unsigned char           CLC1CON             __at(0xE27);
#ifndef _LIB_BUILD
asm("CLC1CON equ 0E27h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned LC1MODE                :3;
        unsigned LC1INTN                :1;
        unsigned LC1INTP                :1;
        unsigned LC1OUT                 :1;
        unsigned                        :1;
        unsigned LC1EN                  :1;
    };
    struct {
        unsigned LC1MODE0               :1;
        unsigned LC1MODE1               :1;
        unsigned LC1MODE2               :1;
    };
} CLC1CONbits_t;
extern volatile CLC1CONbits_t CLC1CONbits __at(0xE27);
// bitfield macros
#define _CLC1CON_MODE_POSN                                  0x0
#define _CLC1CON_MODE_POSITION                              0x0
#define _CLC1CON_MODE_SIZE                                  0x3
#define _CLC1CON_MODE_LENGTH                                0x3
#define _CLC1CON_MODE_MASK                                  0x7
#define _CLC1CON_INTN_POSN                                  0x3
#define _CLC1CON_INTN_POSITION                              0x3
#define _CLC1CON_INTN_SIZE                                  0x1
#define _CLC1CON_INTN_LENGTH                                0x1
#define _CLC1CON_INTN_MASK                                  0x8
#define _CLC1CON_INTP_POSN                                  0x4
#define _CLC1CON_INTP_POSITION                              0x4
#define _CLC1CON_INTP_SIZE                                  0x1
#define _CLC1CON_INTP_LENGTH                                0x1
#define _CLC1CON_INTP_MASK                                  0x10
#define _CLC1CON_OUT_POSN                                   0x5
#define _CLC1CON_OUT_POSITION                               0x5
#define _CLC1CON_OUT_SIZE                                   0x1
#define _CLC1CON_OUT_LENGTH                                 0x1
#define _CLC1CON_OUT_MASK                                   0x20
#define _CLC1CON_EN_POSN                                    0x7
#define _CLC1CON_EN_POSITION                                0x7
#define _CLC1CON_EN_SIZE                                    0x1
#define _CLC1CON_EN_LENGTH                                  0x1
#define _CLC1CON_EN_MASK                                    0x80
#define _CLC1CON_MODE0_POSN                                 0x0
#define _CLC1CON_MODE0_POSITION                             0x0
#define _CLC1CON_MODE0_SIZE                                 0x1
#define _CLC1CON_MODE0_LENGTH                               0x1
#define _CLC1CON_MODE0_MASK                                 0x1
#define _CLC1CON_MODE1_POSN                                 0x1
#define _CLC1CON_MODE1_POSITION                             0x1
#define _CLC1CON_MODE1_SIZE                                 0x1
#define _CLC1CON_MODE1_LENGTH                               0x1
#define _CLC1CON_MODE1_MASK                                 0x2
#define _CLC1CON_MODE2_POSN                                 0x2
#define _CLC1CON_MODE2_POSITION                             0x2
#define _CLC1CON_MODE2_SIZE                                 0x1
#define _CLC1CON_MODE2_LENGTH                               0x1
#define _CLC1CON_MODE2_MASK                                 0x4
#define _CLC1CON_LC1MODE_POSN                               0x0
#define _CLC1CON_LC1MODE_POSITION                           0x0
#define _CLC1CON_LC1MODE_SIZE                               0x3
#define _CLC1CON_LC1MODE_LENGTH                             0x3
#define _CLC1CON_LC1MODE_MASK                               0x7
#define _CLC1CON_LC1INTN_POSN                               0x3
#define _CLC1CON_LC1INTN_POSITION                           0x3
#define _CLC1CON_LC1INTN_SIZE                               0x1
#define _CLC1CON_LC1INTN_LENGTH                             0x1
#define _CLC1CON_LC1INTN_MASK                               0x8
#define _CLC1CON_LC1INTP_POSN                               0x4
#define _CLC1CON_LC1INTP_POSITION                           0x4
#define _CLC1CON_LC1INTP_SIZE                               0x1
#define _CLC1CON_LC1INTP_LENGTH                             0x1
#define _CLC1CON_LC1INTP_MASK                               0x10
#define _CLC1CON_LC1OUT_POSN                                0x5
#define _CLC1CON_LC1OUT_POSITION                            0x5
#define _CLC1CON_LC1OUT_SIZE                                0x1
#define _CLC1CON_LC1OUT_LENGTH                              0x1
#define _CLC1CON_LC1OUT_MASK                                0x20
#define _CLC1CON_LC1EN_POSN                                 0x7
#define _CLC1CON_LC1EN_POSITION                             0x7
#define _CLC1CON_LC1EN_SIZE                                 0x1
#define _CLC1CON_LC1EN_LENGTH                               0x1
#define _CLC1CON_LC1EN_MASK                                 0x80
#define _CLC1CON_LC1MODE0_POSN                              0x0
#define _CLC1CON_LC1MODE0_POSITION                          0x0
#define _CLC1CON_LC1MODE0_SIZE                              0x1
#define _CLC1CON_LC1MODE0_LENGTH                            0x1
#define _CLC1CON_LC1MODE0_MASK                              0x1
#define _CLC1CON_LC1MODE1_POSN                              0x1
#define _CLC1CON_LC1MODE1_POSITION                          0x1
#define _CLC1CON_LC1MODE1_SIZE                              0x1
#define _CLC1CON_LC1MODE1_LENGTH                            0x1
#define _CLC1CON_LC1MODE1_MASK                              0x2
#define _CLC1CON_LC1MODE2_POSN                              0x2
#define _CLC1CON_LC1MODE2_POSITION                          0x2
#define _CLC1CON_LC1MODE2_SIZE                              0x1
#define _CLC1CON_LC1MODE2_LENGTH                            0x1
#define _CLC1CON_LC1MODE2_MASK                              0x4

// Register: CLC1POL
#define CLC1POL CLC1POL
extern volatile unsigned char           CLC1POL             __at(0xE28);
#ifndef _LIB_BUILD
asm("CLC1POL equ 0E28h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
    struct {
        unsigned LC1G1POL               :1;
        unsigned LC1G2POL               :1;
        unsigned LC1G3POL               :1;
        unsigned LC1G4POL               :1;
        unsigned                        :3;
        unsigned LC1POL                 :1;
    };
} CLC1POLbits_t;
