MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
extern volatile CLC5SEL1bits_t CLC5SEL1bits __at(0xE52);
// bitfield macros
#define _CLC5SEL1_D2S_POSN                                  0x0
#define _CLC5SEL1_D2S_POSITION                              0x0
#define _CLC5SEL1_D2S_SIZE                                  0x8
#define _CLC5SEL1_D2S_LENGTH                                0x8
#define _CLC5SEL1_D2S_MASK                                  0xFF
#define _CLC5SEL1_LC5D2S_POSN                               0x0
#define _CLC5SEL1_LC5D2S_POSITION                           0x0
#define _CLC5SEL1_LC5D2S_SIZE                               0x8
#define _CLC5SEL1_LC5D2S_LENGTH                             0x8
#define _CLC5SEL1_LC5D2S_MASK                               0xFF
#define _CLC5SEL1_D2S0_POSN                                 0x0
#define _CLC5SEL1_D2S0_POSITION                             0x0
#define _CLC5SEL1_D2S0_SIZE                                 0x1
#define _CLC5SEL1_D2S0_LENGTH                               0x1
#define _CLC5SEL1_D2S0_MASK                                 0x1
#define _CLC5SEL1_D2S1_POSN                                 0x1
#define _CLC5SEL1_D2S1_POSITION                             0x1
#define _CLC5SEL1_D2S1_SIZE                                 0x1
#define _CLC5SEL1_D2S1_LENGTH                               0x1
#define _CLC5SEL1_D2S1_MASK                                 0x2
#define _CLC5SEL1_D2S2_POSN                                 0x2
#define _CLC5SEL1_D2S2_POSITION                             0x2
#define _CLC5SEL1_D2S2_SIZE                                 0x1
#define _CLC5SEL1_D2S2_LENGTH                               0x1
#define _CLC5SEL1_D2S2_MASK                                 0x4
#define _CLC5SEL1_D2S3_POSN                                 0x3
#define _CLC5SEL1_D2S3_POSITION                             0x3
#define _CLC5SEL1_D2S3_SIZE                                 0x1
#define _CLC5SEL1_D2S3_LENGTH                               0x1
#define _CLC5SEL1_D2S3_MASK                                 0x8
#define _CLC5SEL1_D2S4_POSN                                 0x4
#define _CLC5SEL1_D2S4_POSITION                             0x4
#define _CLC5SEL1_D2S4_SIZE                                 0x1
#define _CLC5SEL1_D2S4_LENGTH                               0x1
#define _CLC5SEL1_D2S4_MASK                                 0x10
#define _CLC5SEL1_D2S5_POSN                                 0x5
#define _CLC5SEL1_D2S5_POSITION                             0x5
#define _CLC5SEL1_D2S5_SIZE                                 0x1
#define _CLC5SEL1_D2S5_LENGTH                               0x1
#define _CLC5SEL1_D2S5_MASK                                 0x20
#define _CLC5SEL1_D2S6_POSN                                 0x6
#define _CLC5SEL1_D2S6_POSITION                             0x6
#define _CLC5SEL1_D2S6_SIZE                                 0x1
#define _CLC5SEL1_D2S6_LENGTH                               0x1
#define _CLC5SEL1_D2S6_MASK                                 0x40
#define _CLC5SEL1_D2S7_POSN                                 0x7
#define _CLC5SEL1_D2S7_POSITION                             0x7
#define _CLC5SEL1_D2S7_SIZE                                 0x1
#define _CLC5SEL1_D2S7_LENGTH                               0x1
#define _CLC5SEL1_D2S7_MASK                                 0x80
#define _CLC5SEL1_LC5D2S0_POSN                              0x0
#define _CLC5SEL1_LC5D2S0_POSITION                          0x0
#define _CLC5SEL1_LC5D2S0_SIZE                              0x1
#define _CLC5SEL1_LC5D2S0_LENGTH                            0x1
#define _CLC5SEL1_LC5D2S0_MASK                              0x1
#define _CLC5SEL1_LC5D2S1_POSN                              0x1
#define _CLC5SEL1_LC5D2S1_POSITION                          0x1
#define _CLC5SEL1_LC5D2S1_SIZE                              0x1
#define _CLC5SEL1_LC5D2S1_LENGTH                            0x1
#define _CLC5SEL1_LC5D2S1_MASK                              0x2
#define _CLC5SEL1_LC5D2S2_POSN                              0x2
#define _CLC5SEL1_LC5D2S2_POSITION                          0x2
#define _CLC5SEL1_LC5D2S2_SIZE                              0x1
#define _CLC5SEL1_LC5D2S2_LENGTH                            0x1
#define _CLC5SEL1_LC5D2S2_MASK                              0x4
#define _CLC5SEL1_LC5D2S3_POSN                              0x3
#define _CLC5SEL1_LC5D2S3_POSITION                          0x3
#define _CLC5SEL1_LC5D2S3_SIZE                              0x1
#define _CLC5SEL1_LC5D2S3_LENGTH                            0x1
#define _CLC5SEL1_LC5D2S3_MASK                              0x8
#define _CLC5SEL1_LC5D2S4_POSN                              0x4
#define _CLC5SEL1_LC5D2S4_POSITION                          0x4
#define _CLC5SEL1_LC5D2S4_SIZE                              0x1
#define _CLC5SEL1_LC5D2S4_LENGTH                            0x1
#define _CLC5SEL1_LC5D2S4_MASK                              0x10
#define _CLC5SEL1_LC5D2S5_POSN                              0x5
#define _CLC5SEL1_LC5D2S5_POSITION                          0x5
#define _CLC5SEL1_LC5D2S5_SIZE                              0x1
#define _CLC5SEL1_LC5D2S5_LENGTH                            0x1
#define _CLC5SEL1_LC5D2S5_MASK                              0x20
#define _CLC5SEL1_LC5D2S6_POSN                              0x6
#define _CLC5SEL1_LC5D2S6_POSITION                          0x6
#define _CLC5SEL1_LC5D2S6_SIZE                              0x1
#define _CLC5SEL1_LC5D2S6_LENGTH                            0x1
#define _CLC5SEL1_LC5D2S6_MASK                              0x40
#define _CLC5SEL1_LC5D2S7_POSN                              0x7
#define _CLC5SEL1_LC5D2S7_POSITION                          0x7
#define _CLC5SEL1_LC5D2S7_SIZE                              0x1
#define _CLC5SEL1_LC5D2S7_LENGTH                            0x1
#define _CLC5SEL1_LC5D2S7_MASK                              0x80

// Register: CLC5SEL2
#define CLC5SEL2 CLC5SEL2
extern volatile unsigned char           CLC5SEL2            __at(0xE53);
#ifndef _LIB_BUILD
asm("CLC5SEL2 equ 0E53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D3S                    :8;
    };
    struct {
        unsigned LC5D3S                 :8;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned D3S3                   :1;
        unsigned D3S4                   :1;
        unsigned D3S5                   :1;
        unsigned D3S6                   :1;
        unsigned D3S7                   :1;
    };
    struct {
        unsigned LC5D3S0                :1;
        unsigned LC5D3S1                :1;
        unsigned LC5D3S2                :1;
        unsigned LC5D3S3                :1;
        unsigned LC5D3S4                :1;
        unsigned LC5D3S5                :1;
        unsigned LC5D3S6                :1;
        unsigned LC5D3S7                :1;
    };
} CLC5SEL2bits_t;
