MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
// Register: CLC6POL
#define CLC6POL CLC6POL
extern volatile unsigned char           CLC6POL             __at(0xE5A);
#ifndef _LIB_BUILD
asm("CLC6POL equ 0E5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
    struct {
        unsigned LC6G1POL               :1;
        unsigned LC6G2POL               :1;
        unsigned LC6G3POL               :1;
        unsigned LC6G4POL               :1;
        unsigned                        :3;
        unsigned LC6POL                 :1;
    };
} CLC6POLbits_t;
extern volatile CLC6POLbits_t CLC6POLbits __at(0xE5A);
// bitfield macros
#define _CLC6POL_G1POL_POSN                                 0x0
#define _CLC6POL_G1POL_POSITION                             0x0
#define _CLC6POL_G1POL_SIZE                                 0x1
#define _CLC6POL_G1POL_LENGTH                               0x1
#define _CLC6POL_G1POL_MASK                                 0x1
#define _CLC6POL_G2POL_POSN                                 0x1
#define _CLC6POL_G2POL_POSITION                             0x1
#define _CLC6POL_G2POL_SIZE                                 0x1
#define _CLC6POL_G2POL_LENGTH                               0x1
#define _CLC6POL_G2POL_MASK                                 0x2
#define _CLC6POL_G3POL_POSN                                 0x2
#define _CLC6POL_G3POL_POSITION                             0x2
#define _CLC6POL_G3POL_SIZE                                 0x1
#define _CLC6POL_G3POL_LENGTH                               0x1
#define _CLC6POL_G3POL_MASK                                 0x4
#define _CLC6POL_G4POL_POSN                                 0x3
#define _CLC6POL_G4POL_POSITION                             0x3
#define _CLC6POL_G4POL_SIZE                                 0x1
#define _CLC6POL_G4POL_LENGTH                               0x1
#define _CLC6POL_G4POL_MASK                                 0x8
#define _CLC6POL_POL_POSN                                   0x7
#define _CLC6POL_POL_POSITION                               0x7
#define _CLC6POL_POL_SIZE                                   0x1
#define _CLC6POL_POL_LENGTH                                 0x1
#define _CLC6POL_POL_MASK                                   0x80
#define _CLC6POL_LC6G1POL_POSN                              0x0
#define _CLC6POL_LC6G1POL_POSITION                          0x0
#define _CLC6POL_LC6G1POL_SIZE                              0x1
#define _CLC6POL_LC6G1POL_LENGTH                            0x1
#define _CLC6POL_LC6G1POL_MASK                              0x1
#define _CLC6POL_LC6G2POL_POSN                              0x1
#define _CLC6POL_LC6G2POL_POSITION                          0x1
#define _CLC6POL_LC6G2POL_SIZE                              0x1
#define _CLC6POL_LC6G2POL_LENGTH                            0x1
#define _CLC6POL_LC6G2POL_MASK                              0x2
#define _CLC6POL_LC6G3POL_POSN                              0x2
#define _CLC6POL_LC6G3POL_POSITION                          0x2
#define _CLC6POL_LC6G3POL_SIZE                              0x1
#define _CLC6POL_LC6G3POL_LENGTH                            0x1
#define _CLC6POL_LC6G3POL_MASK                              0x4
#define _CLC6POL_LC6G4POL_POSN                              0x3
#define _CLC6POL_LC6G4POL_POSITION                          0x3
#define _CLC6POL_LC6G4POL_SIZE                              0x1
#define _CLC6POL_LC6G4POL_LENGTH                            0x1
#define _CLC6POL_LC6G4POL_MASK                              0x8
#define _CLC6POL_LC6POL_POSN                                0x7
#define _CLC6POL_LC6POL_POSITION                            0x7
#define _CLC6POL_LC6POL_SIZE                                0x1
#define _CLC6POL_LC6POL_LENGTH                              0x1
#define _CLC6POL_LC6POL_MASK                                0x80

// Register: CLC6SEL0
#define CLC6SEL0 CLC6SEL0
extern volatile unsigned char           CLC6SEL0            __at(0xE5B);
#ifndef _LIB_BUILD
asm("CLC6SEL0 equ 0E5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1S                    :8;
    };
    struct {
        unsigned LC6D1S                 :8;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned D1S3                   :1;
        unsigned D1S4                   :1;
        unsigned D1S5                   :1;
        unsigned D1S6                   :1;
        unsigned D1S7                   :1;
    };
    struct {
        unsigned LC6D1S0                :1;
        unsigned LC6D1S1                :1;
        unsigned LC6D1S2                :1;
        unsigned LC6D1S3                :1;
        unsigned LC6D1S4                :1;
        unsigned LC6D1S5                :1;
        unsigned LC6D1S6                :1;
        unsigned LC6D1S7                :1;
    };
} CLC6SEL0bits_t;
extern volatile CLC6SEL0bits_t CLC6SEL0bits __at(0xE5B);
// bitfield macros
#define _CLC6SEL0_D1S_POSN                                  0x0
#define _CLC6SEL0_D1S_POSITION                              0x0
#define _CLC6SEL0_D1S_SIZE                                  0x8
#define _CLC6SEL0_D1S_LENGTH                                0x8
#define _CLC6SEL0_D1S_MASK                                  0xFF
#define _CLC6SEL0_LC6D1S_POSN                               0x0
#define _CLC6SEL0_LC6D1S_POSITION                           0x0
#define _CLC6SEL0_LC6D1S_SIZE                               0x8
#define _CLC6SEL0_LC6D1S_LENGTH                             0x8
#define _CLC6SEL0_LC6D1S_MASK                               0xFF
#define _CLC6SEL0_D1S0_POSN                                 0x0
#define _CLC6SEL0_D1S0_POSITION                             0x0
#define _CLC6SEL0_D1S0_SIZE                                 0x1
#define _CLC6SEL0_D1S0_LENGTH                               0x1
#define _CLC6SEL0_D1S0_MASK                                 0x1
#define _CLC6SEL0_D1S1_POSN                                 0x1
#define _CLC6SEL0_D1S1_POSITION                             0x1
#define _CLC6SEL0_D1S1_SIZE                                 0x1
#define _CLC6SEL0_D1S1_LENGTH                               0x1
#define _CLC6SEL0_D1S1_MASK                                 0x2
#define _CLC6SEL0_D1S2_POSN                                 0x2
#define _CLC6SEL0_D1S2_POSITION                             0x2
#define _CLC6SEL0_D1S2_SIZE                                 0x1
#define _CLC6SEL0_D1S2_LENGTH                               0x1
#define _CLC6SEL0_D1S2_MASK                                 0x4
#define _CLC6SEL0_D1S3_POSN                                 0x3
#define _CLC6SEL0_D1S3_POSITION                             0x3
#define _CLC6SEL0_D1S3_SIZE                                 0x1
#define _CLC6SEL0_D1S3_LENGTH                               0x1
#define _CLC6SEL0_D1S3_MASK                                 0x8
#define _CLC6SEL0_D1S4_POSN                                 0x4
#define _CLC6SEL0_D1S4_POSITION                             0x4
#define _CLC6SEL0_D1S4_SIZE                                 0x1
#define _CLC6SEL0_D1S4_LENGTH                               0x1
#define _CLC6SEL0_D1S4_MASK                                 0x10
#define _CLC6SEL0_D1S5_POSN                                 0x5
#define _CLC6SEL0_D1S5_POSITION                             0x5
#define _CLC6SEL0_D1S5_SIZE                                 0x1
#define _CLC6SEL0_D1S5_LENGTH                               0x1
#define _CLC6SEL0_D1S5_MASK                                 0x20
#define _CLC6SEL0_D1S6_POSN                                 0x6
#define _CLC6SEL0_D1S6_POSITION                             0x6
#define _CLC6SEL0_D1S6_SIZE                                 0x1
#define _CLC6SEL0_D1S6_LENGTH                               0x1
#define _CLC6SEL0_D1S6_MASK                                 0x40
#define _CLC6SEL0_D1S7_POSN                                 0x7
#define _CLC6SEL0_D1S7_POSITION                             0x7
#define _CLC6SEL0_D1S7_SIZE                                 0x1
#define _CLC6SEL0_D1S7_LENGTH                               0x1
#define _CLC6SEL0_D1S7_MASK                                 0x80
#define _CLC6SEL0_LC6D1S0_POSN                              0x0
#define _CLC6SEL0_LC6D1S0_POSITION                          0x0
#define _CLC6SEL0_LC6D1S0_SIZE                              0x1
#define _CLC6SEL0_LC6D1S0_LENGTH                            0x1
#define _CLC6SEL0_LC6D1S0_MASK                              0x1
#define _CLC6SEL0_LC6D1S1_POSN                              0x1
#define _CLC6SEL0_LC6D1S1_POSITION                          0x1
#define _CLC6SEL0_LC6D1S1_SIZE                              0x1
#define _CLC6SEL0_LC6D1S1_LENGTH                            0x1
#define _CLC6SEL0_LC6D1S1_MASK                              0x2
#define _CLC6SEL0_LC6D1S2_POSN                              0x2
#define _CLC6SEL0_LC6D1S2_POSITION                          0x2
#define _CLC6SEL0_LC6D1S2_SIZE                              0x1
#define _CLC6SEL0_LC6D1S2_LENGTH                            0x1
#define _CLC6SEL0_LC6D1S2_MASK                              0x4
#define _CLC6SEL0_LC6D1S3_POSN                              0x3
#define _CLC6SEL0_LC6D1S3_POSITION                          0x3
#define _CLC6SEL0_LC6D1S3_SIZE                              0x1
#define _CLC6SEL0_LC6D1S3_LENGTH                            0x1
#define _CLC6SEL0_LC6D1S3_MASK                              0x8
#define _CLC6SEL0_LC6D1S4_POSN                              0x4
#define _CLC6SEL0_LC6D1S4_POSITION                          0x4
#define _CLC6SEL0_LC6D1S4_SIZE                              0x1
#define _CLC6SEL0_LC6D1S4_LENGTH                            0x1
#define _CLC6SEL0_LC6D1S4_MASK                              0x10
#define _CLC6SEL0_LC6D1S5_POSN                              0x5
#define _CLC6SEL0_LC6D1S5_POSITION                          0x5
#define _CLC6SEL0_LC6D1S5_SIZE                              0x1
#define _CLC6SEL0_LC6D1S5_LENGTH                            0x1
#define _CLC6SEL0_LC6D1S5_MASK                              0x20
#define _CLC6SEL0_LC6D1S6_POSN                              0x6
#define _CLC6SEL0_LC6D1S6_POSITION                          0x6
#define _CLC6SEL0_LC6D1S6_SIZE                              0x1
#define _CLC6SEL0_LC6D1S6_LENGTH                            0x1
#define _CLC6SEL0_LC6D1S6_MASK                              0x40
#define _CLC6SEL0_LC6D1S7_POSN                              0x7
#define _CLC6SEL0_LC6D1S7_POSITION                          0x7
#define _CLC6SEL0_LC6D1S7_SIZE                              0x1
#define _CLC6SEL0_LC6D1S7_LENGTH                            0x1
#define _CLC6SEL0_LC6D1S7_MASK                              0x80

// Register: CLC6SEL1
#define CLC6SEL1 CLC6SEL1
extern volatile unsigned char           CLC6SEL1            __at(0xE5C);
#ifndef _LIB_BUILD
asm("CLC6SEL1 equ 0E5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D2S                    :8;
    };
    struct {
        unsigned LC6D2S                 :8;
    };
    struct {
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
        unsigned D2S3                   :1;
        unsigned D2S4                   :1;
        unsigned D2S5                   :1;
        unsigned D2S6                   :1;
        unsigned D2S7                   :1;
    };
    struct {
        unsigned LC6D2S0                :1;
        unsigned LC6D2S1                :1;
        unsigned LC6D2S2                :1;
        unsigned LC6D2S3                :1;
        unsigned LC6D2S4                :1;
        unsigned LC6D2S5                :1;
        unsigned LC6D2S6                :1;
        unsigned LC6D2S7                :1;
    };
} CLC6SEL1bits_t;
extern volatile CLC6SEL1bits_t CLC6SEL1bits __at(0xE5C);
// bitfield macros
#define _CLC6SEL1_D2S_POSN                                  0x0
#define _CLC6SEL1_D2S_POSITION                              0x0
#define _CLC6SEL1_D2S_SIZE                                  0x8
#define _CLC6SEL1_D2S_LENGTH                                0x8
#define _CLC6SEL1_D2S_MASK                                  0xFF
#define _CLC6SEL1_LC6D2S_POSN                               0x0
#define _CLC6SEL1_LC6D2S_POSITION                           0x0
#define _CLC6SEL1_LC6D2S_SIZE                               0x8
#define _CLC6SEL1_LC6D2S_LENGTH                             0x8
#define _CLC6SEL1_LC6D2S_MASK                               0xFF
#define _CLC6SEL1_D2S0_POSN                                 0x0
#define _CLC6SEL1_D2S0_POSITION                             0x0
#define _CLC6SEL1_D2S0_SIZE                                 0x1
#define _CLC6SEL1_D2S0_LENGTH                               0x1
#define _CLC6SEL1_D2S0_MASK                                 0x1
#define _CLC6SEL1_D2S1_POSN                                 0x1
#define _CLC6SEL1_D2S1_POSITION                             0x1
#define _CLC6SEL1_D2S1_SIZE                                 0x1
#define _CLC6SEL1_D2S1_LENGTH                               0x1
#define _CLC6SEL1_D2S1_MASK                                 0x2
#define _CLC6SEL1_D2S2_POSN                                 0x2
#define _CLC6SEL1_D2S2_POSITION                             0x2
#define _CLC6SEL1_D2S2_SIZE                                 0x1
#define _CLC6SEL1_D2S2_LENGTH                               0x1
#define _CLC6SEL1_D2S2_MASK                                 0x4
#define _CLC6SEL1_D2S3_POSN                                 0x3
#define _CLC6SEL1_D2S3_POSITION                             0x3
#define _CLC6SEL1_D2S3_SIZE                                 0x1
#define _CLC6SEL1_D2S3_LENGTH                               0x1
#define _CLC6SEL1_D2S3_MASK                                 0x8
#define _CLC6SEL1_D2S4_POSN                                 0x4
#define _CLC6SEL1_D2S4_POSITION                             0x4
#define _CLC6SEL1_D2S4_SIZE                                 0x1
#define _CLC6SEL1_D2S4_LENGTH                               0x1
#define _CLC6SEL1_D2S4_MASK                                 0x10
#define _CLC6SEL1_D2S5_POSN                                 0x5
#define _CLC6SEL1_D2S5_POSITION                             0x5
#define _CLC6SEL1_D2S5_SIZE                                 0x1
#define _CLC6SEL1_D2S5_LENGTH                               0x1
#define _CLC6SEL1_D2S5_MASK                                 0x20
#define _CLC6SEL1_D2S6_POSN                                 0x6
#define _CLC6SEL1_D2S6_POSITION                             0x6
#define _CLC6SEL1_D2S6_SIZE                                 0x1
#define _CLC6SEL1_D2S6_LENGTH                               0x1
#define _CLC6SEL1_D2S6_MASK                                 0x40
#define _CLC6SEL1_D2S7_POSN                                 0x7
#define _CLC6SEL1_D2S7_POSITION                             0x7
#define _CLC6SEL1_D2S7_SIZE                                 0x1
#define _CLC6SEL1_D2S7_LENGTH                               0x1
#define _CLC6SEL1_D2S7_MASK                                 0x80
#define _CLC6SEL1_LC6D2S0_POSN                              0x0
#define _CLC6SEL1_LC6D2S0_POSITION                          0x0
#define _CLC6SEL1_LC6D2S0_SIZE                              0x1
#define _CLC6SEL1_LC6D2S0_LENGTH                            0x1
#define _CLC6SEL1_LC6D2S0_MASK                              0x1
#define _CLC6SEL1_LC6D2S1_POSN                              0x1
#define _CLC6SEL1_LC6D2S1_POSITION                          0x1
#define _CLC6SEL1_LC6D2S1_SIZE                              0x1
#define _CLC6SEL1_LC6D2S1_LENGTH                            0x1
#define _CLC6SEL1_LC6D2S1_MASK                              0x2
#define _CLC6SEL1_LC6D2S2_POSN                              0x2
#define _CLC6SEL1_LC6D2S2_POSITION                          0x2
#define _CLC6SEL1_LC6D2S2_SIZE                              0x1
#define _CLC6SEL1_LC6D2S2_LENGTH                            0x1
#define _CLC6SEL1_LC6D2S2_MASK                              0x4
#define _CLC6SEL1_LC6D2S3_POSN                              0x3
#define _CLC6SEL1_LC6D2S3_POSITION                          0x3
#define _CLC6SEL1_LC6D2S3_SIZE                              0x1
#define _CLC6SEL1_LC6D2S3_LENGTH                            0x1
#define _CLC6SEL1_LC6D2S3_MASK                              0x8
#define _CLC6SEL1_LC6D2S4_POSN                              0x4
#define _CLC6SEL1_LC6D2S4_POSITION                          0x4
#define _CLC6SEL1_LC6D2S4_SIZE                              0x1
#define _CLC6SEL1_LC6D2S4_LENGTH                            0x1
#define _CLC6SEL1_LC6D2S4_MASK                              0x10
#define _CLC6SEL1_LC6D2S5_POSN                              0x5
#define _CLC6SEL1_LC6D2S5_POSITION                          0x5
#define _CLC6SEL1_LC6D2S5_SIZE                              0x1
#define _CLC6SEL1_LC6D2S5_LENGTH                            0x1
#define _CLC6SEL1_LC6D2S5_MASK                              0x20
#define _CLC6SEL1_LC6D2S6_POSN                              0x6
#define _CLC6SEL1_LC6D2S6_POSITION                          0x6
#define _CLC6SEL1_LC6D2S6_SIZE                              0x1
#define _CLC6SEL1_LC6D2S6_LENGTH                            0x1
#define _CLC6SEL1_LC6D2S6_MASK                              0x40
#define _CLC6SEL1_LC6D2S7_POSN                              0x7
#define _CLC6SEL1_LC6D2S7_POSITION                          0x7
#define _CLC6SEL1_LC6D2S7_SIZE                              0x1
#define _CLC6SEL1_LC6D2S7_LENGTH                            0x1
#define _CLC6SEL1_LC6D2S7_MASK                              0x80

// Register: CLC6SEL2
#define CLC6SEL2 CLC6SEL2
extern volatile unsigned char           CLC6SEL2            __at(0xE5D);
#ifndef _LIB_BUILD
asm("CLC6SEL2 equ 0E5Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D3S                    :8;
    };
    struct {
        unsigned LC6D3S                 :8;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned D3S3                   :1;
        unsigned D3S4                   :1;
        unsigned D3S5                   :1;
        unsigned D3S6                   :1;
        unsigned D3S7                   :1;
    };
    struct {
        unsigned LC6D3S0                :1;
        unsigned LC6D3S1                :1;
        unsigned LC6D3S2                :1;
        unsigned LC6D3S3                :1;
        unsigned LC6D3S4                :1;
        unsigned LC6D3S5                :1;
        unsigned LC6D3S6                :1;
        unsigned LC6D3S7                :1;
    };
} CLC6SEL2bits_t;
