MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
extern volatile CLC6SEL3bits_t CLC6SEL3bits __at(0xE5E);
// bitfield macros
#define _CLC6SEL3_D4S_POSN                                  0x0
#define _CLC6SEL3_D4S_POSITION                              0x0
#define _CLC6SEL3_D4S_SIZE                                  0x8
#define _CLC6SEL3_D4S_LENGTH                                0x8
#define _CLC6SEL3_D4S_MASK                                  0xFF
#define _CLC6SEL3_LC6D4S_POSN                               0x0
#define _CLC6SEL3_LC6D4S_POSITION                           0x0
#define _CLC6SEL3_LC6D4S_SIZE                               0x8
#define _CLC6SEL3_LC6D4S_LENGTH                             0x8
#define _CLC6SEL3_LC6D4S_MASK                               0xFF
#define _CLC6SEL3_D4S0_POSN                                 0x0
#define _CLC6SEL3_D4S0_POSITION                             0x0
#define _CLC6SEL3_D4S0_SIZE                                 0x1
#define _CLC6SEL3_D4S0_LENGTH                               0x1
#define _CLC6SEL3_D4S0_MASK                                 0x1
#define _CLC6SEL3_D4S1_POSN                                 0x1
#define _CLC6SEL3_D4S1_POSITION                             0x1
#define _CLC6SEL3_D4S1_SIZE                                 0x1
#define _CLC6SEL3_D4S1_LENGTH                               0x1
#define _CLC6SEL3_D4S1_MASK                                 0x2
#define _CLC6SEL3_D4S2_POSN                                 0x2
#define _CLC6SEL3_D4S2_POSITION                             0x2
#define _CLC6SEL3_D4S2_SIZE                                 0x1
#define _CLC6SEL3_D4S2_LENGTH                               0x1
#define _CLC6SEL3_D4S2_MASK                                 0x4
#define _CLC6SEL3_D4S3_POSN                                 0x3
#define _CLC6SEL3_D4S3_POSITION                             0x3
#define _CLC6SEL3_D4S3_SIZE                                 0x1
#define _CLC6SEL3_D4S3_LENGTH                               0x1
#define _CLC6SEL3_D4S3_MASK                                 0x8
#define _CLC6SEL3_D4S4_POSN                                 0x4
#define _CLC6SEL3_D4S4_POSITION                             0x4
#define _CLC6SEL3_D4S4_SIZE                                 0x1
#define _CLC6SEL3_D4S4_LENGTH                               0x1
#define _CLC6SEL3_D4S4_MASK                                 0x10
#define _CLC6SEL3_D4S5_POSN                                 0x5
#define _CLC6SEL3_D4S5_POSITION                             0x5
#define _CLC6SEL3_D4S5_SIZE                                 0x1
#define _CLC6SEL3_D4S5_LENGTH                               0x1
#define _CLC6SEL3_D4S5_MASK                                 0x20
#define _CLC6SEL3_D4S6_POSN                                 0x6
#define _CLC6SEL3_D4S6_POSITION                             0x6
#define _CLC6SEL3_D4S6_SIZE                                 0x1
#define _CLC6SEL3_D4S6_LENGTH                               0x1
#define _CLC6SEL3_D4S6_MASK                                 0x40
#define _CLC6SEL3_D4S7_POSN                                 0x7
#define _CLC6SEL3_D4S7_POSITION                             0x7
#define _CLC6SEL3_D4S7_SIZE                                 0x1
#define _CLC6SEL3_D4S7_LENGTH                               0x1
#define _CLC6SEL3_D4S7_MASK                                 0x80
#define _CLC6SEL3_LC6D4S0_POSN                              0x0
#define _CLC6SEL3_LC6D4S0_POSITION                          0x0
#define _CLC6SEL3_LC6D4S0_SIZE                              0x1
#define _CLC6SEL3_LC6D4S0_LENGTH                            0x1
#define _CLC6SEL3_LC6D4S0_MASK                              0x1
#define _CLC6SEL3_LC6D4S1_POSN                              0x1
#define _CLC6SEL3_LC6D4S1_POSITION                          0x1
#define _CLC6SEL3_LC6D4S1_SIZE                              0x1
#define _CLC6SEL3_LC6D4S1_LENGTH                            0x1
#define _CLC6SEL3_LC6D4S1_MASK                              0x2
#define _CLC6SEL3_LC6D4S2_POSN                              0x2
#define _CLC6SEL3_LC6D4S2_POSITION                          0x2
#define _CLC6SEL3_LC6D4S2_SIZE                              0x1
#define _CLC6SEL3_LC6D4S2_LENGTH                            0x1
#define _CLC6SEL3_LC6D4S2_MASK                              0x4
#define _CLC6SEL3_LC6D4S3_POSN                              0x3
#define _CLC6SEL3_LC6D4S3_POSITION                          0x3
#define _CLC6SEL3_LC6D4S3_SIZE                              0x1
#define _CLC6SEL3_LC6D4S3_LENGTH                            0x1
#define _CLC6SEL3_LC6D4S3_MASK                              0x8
#define _CLC6SEL3_LC6D4S4_POSN                              0x4
#define _CLC6SEL3_LC6D4S4_POSITION                          0x4
#define _CLC6SEL3_LC6D4S4_SIZE                              0x1
#define _CLC6SEL3_LC6D4S4_LENGTH                            0x1
#define _CLC6SEL3_LC6D4S4_MASK                              0x10
#define _CLC6SEL3_LC6D4S5_POSN                              0x5
#define _CLC6SEL3_LC6D4S5_POSITION                          0x5
#define _CLC6SEL3_LC6D4S5_SIZE                              0x1
#define _CLC6SEL3_LC6D4S5_LENGTH                            0x1
#define _CLC6SEL3_LC6D4S5_MASK                              0x20
#define _CLC6SEL3_LC6D4S6_POSN                              0x6
#define _CLC6SEL3_LC6D4S6_POSITION                          0x6
#define _CLC6SEL3_LC6D4S6_SIZE                              0x1
#define _CLC6SEL3_LC6D4S6_LENGTH                            0x1
#define _CLC6SEL3_LC6D4S6_MASK                              0x40
#define _CLC6SEL3_LC6D4S7_POSN                              0x7
#define _CLC6SEL3_LC6D4S7_POSITION                          0x7
#define _CLC6SEL3_LC6D4S7_SIZE                              0x1
#define _CLC6SEL3_LC6D4S7_LENGTH                            0x1
#define _CLC6SEL3_LC6D4S7_MASK                              0x80

// Register: CLC6GLS0
#define CLC6GLS0 CLC6GLS0
extern volatile unsigned char           CLC6GLS0            __at(0xE5F);
#ifndef _LIB_BUILD
asm("CLC6GLS0 equ 0E5Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1D1N                  :1;
        unsigned G1D1T                  :1;
        unsigned G1D2N                  :1;
        unsigned G1D2T                  :1;
        unsigned G1D3N                  :1;
        unsigned G1D3T                  :1;
        unsigned G1D4N                  :1;
        unsigned G1D4T                  :1;
    };
    struct {
        unsigned LC6G1D1N               :1;
        unsigned LC6G1D1T               :1;
        unsigned LC6G1D2N               :1;
        unsigned LC6G1D2T               :1;
        unsigned LC6G1D3N               :1;
        unsigned LC6G1D3T               :1;
        unsigned LC6G1D4N               :1;
        unsigned LC6G1D4T               :1;
    };
} CLC6GLS0bits_t;
extern volatile CLC6GLS0bits_t CLC6GLS0bits __at(0xE5F);
// bitfield macros
#define _CLC6GLS0_G1D1N_POSN                                0x0
#define _CLC6GLS0_G1D1N_POSITION                            0x0
#define _CLC6GLS0_G1D1N_SIZE                                0x1
#define _CLC6GLS0_G1D1N_LENGTH                              0x1
#define _CLC6GLS0_G1D1N_MASK                                0x1
#define _CLC6GLS0_G1D1T_POSN                                0x1
#define _CLC6GLS0_G1D1T_POSITION                            0x1
#define _CLC6GLS0_G1D1T_SIZE                                0x1
#define _CLC6GLS0_G1D1T_LENGTH                              0x1
#define _CLC6GLS0_G1D1T_MASK                                0x2
#define _CLC6GLS0_G1D2N_POSN                                0x2
#define _CLC6GLS0_G1D2N_POSITION                            0x2
#define _CLC6GLS0_G1D2N_SIZE                                0x1
#define _CLC6GLS0_G1D2N_LENGTH                              0x1
#define _CLC6GLS0_G1D2N_MASK                                0x4
#define _CLC6GLS0_G1D2T_POSN                                0x3
#define _CLC6GLS0_G1D2T_POSITION                            0x3
#define _CLC6GLS0_G1D2T_SIZE                                0x1
#define _CLC6GLS0_G1D2T_LENGTH                              0x1
#define _CLC6GLS0_G1D2T_MASK                                0x8
#define _CLC6GLS0_G1D3N_POSN                                0x4
#define _CLC6GLS0_G1D3N_POSITION                            0x4
#define _CLC6GLS0_G1D3N_SIZE                                0x1
#define _CLC6GLS0_G1D3N_LENGTH                              0x1
#define _CLC6GLS0_G1D3N_MASK                                0x10
#define _CLC6GLS0_G1D3T_POSN                                0x5
#define _CLC6GLS0_G1D3T_POSITION                            0x5
#define _CLC6GLS0_G1D3T_SIZE                                0x1
#define _CLC6GLS0_G1D3T_LENGTH                              0x1
#define _CLC6GLS0_G1D3T_MASK                                0x20
#define _CLC6GLS0_G1D4N_POSN                                0x6
#define _CLC6GLS0_G1D4N_POSITION                            0x6
#define _CLC6GLS0_G1D4N_SIZE                                0x1
#define _CLC6GLS0_G1D4N_LENGTH                              0x1
#define _CLC6GLS0_G1D4N_MASK                                0x40
#define _CLC6GLS0_G1D4T_POSN                                0x7
#define _CLC6GLS0_G1D4T_POSITION                            0x7
#define _CLC6GLS0_G1D4T_SIZE                                0x1
#define _CLC6GLS0_G1D4T_LENGTH                              0x1
#define _CLC6GLS0_G1D4T_MASK                                0x80
#define _CLC6GLS0_LC6G1D1N_POSN                             0x0
#define _CLC6GLS0_LC6G1D1N_POSITION                         0x0
#define _CLC6GLS0_LC6G1D1N_SIZE                             0x1
#define _CLC6GLS0_LC6G1D1N_LENGTH                           0x1
#define _CLC6GLS0_LC6G1D1N_MASK                             0x1
#define _CLC6GLS0_LC6G1D1T_POSN                             0x1
#define _CLC6GLS0_LC6G1D1T_POSITION                         0x1
#define _CLC6GLS0_LC6G1D1T_SIZE                             0x1
#define _CLC6GLS0_LC6G1D1T_LENGTH                           0x1
#define _CLC6GLS0_LC6G1D1T_MASK                             0x2
#define _CLC6GLS0_LC6G1D2N_POSN                             0x2
#define _CLC6GLS0_LC6G1D2N_POSITION                         0x2
#define _CLC6GLS0_LC6G1D2N_SIZE                             0x1
#define _CLC6GLS0_LC6G1D2N_LENGTH                           0x1
#define _CLC6GLS0_LC6G1D2N_MASK                             0x4
#define _CLC6GLS0_LC6G1D2T_POSN                             0x3
#define _CLC6GLS0_LC6G1D2T_POSITION                         0x3
#define _CLC6GLS0_LC6G1D2T_SIZE                             0x1
#define _CLC6GLS0_LC6G1D2T_LENGTH                           0x1
#define _CLC6GLS0_LC6G1D2T_MASK                             0x8
#define _CLC6GLS0_LC6G1D3N_POSN                             0x4
#define _CLC6GLS0_LC6G1D3N_POSITION                         0x4
#define _CLC6GLS0_LC6G1D3N_SIZE                             0x1
#define _CLC6GLS0_LC6G1D3N_LENGTH                           0x1
#define _CLC6GLS0_LC6G1D3N_MASK                             0x10
#define _CLC6GLS0_LC6G1D3T_POSN                             0x5
#define _CLC6GLS0_LC6G1D3T_POSITION                         0x5
#define _CLC6GLS0_LC6G1D3T_SIZE                             0x1
#define _CLC6GLS0_LC6G1D3T_LENGTH                           0x1
#define _CLC6GLS0_LC6G1D3T_MASK                             0x20
#define _CLC6GLS0_LC6G1D4N_POSN                             0x6
#define _CLC6GLS0_LC6G1D4N_POSITION                         0x6
#define _CLC6GLS0_LC6G1D4N_SIZE                             0x1
#define _CLC6GLS0_LC6G1D4N_LENGTH                           0x1
#define _CLC6GLS0_LC6G1D4N_MASK                             0x40
#define _CLC6GLS0_LC6G1D4T_POSN                             0x7
#define _CLC6GLS0_LC6G1D4T_POSITION                         0x7
#define _CLC6GLS0_LC6G1D4T_SIZE                             0x1
#define _CLC6GLS0_LC6G1D4T_LENGTH                           0x1
#define _CLC6GLS0_LC6G1D4T_MASK                             0x80

// Register: CLC6GLS1
#define CLC6GLS1 CLC6GLS1
extern volatile unsigned char           CLC6GLS1            __at(0xE60);
#ifndef _LIB_BUILD
asm("CLC6GLS1 equ 0E60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G2D1N                  :1;
        unsigned G2D1T                  :1;
        unsigned G2D2N                  :1;
        unsigned G2D2T                  :1;
        unsigned G2D3N                  :1;
        unsigned G2D3T                  :1;
        unsigned G2D4N                  :1;
        unsigned G2D4T                  :1;
    };
    struct {
        unsigned LC6G2D1N               :1;
        unsigned LC6G2D1T               :1;
        unsigned LC6G2D2N               :1;
        unsigned LC6G2D2T               :1;
        unsigned LC6G2D3N               :1;
        unsigned LC6G2D3T               :1;
        unsigned LC6G2D4N               :1;
        unsigned LC6G2D4T               :1;
    };
} CLC6GLS1bits_t;
extern volatile CLC6GLS1bits_t CLC6GLS1bits __at(0xE60);
// bitfield macros
#define _CLC6GLS1_G2D1N_POSN                                0x0
#define _CLC6GLS1_G2D1N_POSITION                            0x0
#define _CLC6GLS1_G2D1N_SIZE                                0x1
#define _CLC6GLS1_G2D1N_LENGTH                              0x1
#define _CLC6GLS1_G2D1N_MASK                                0x1
#define _CLC6GLS1_G2D1T_POSN                                0x1
#define _CLC6GLS1_G2D1T_POSITION                            0x1
#define _CLC6GLS1_G2D1T_SIZE                                0x1
#define _CLC6GLS1_G2D1T_LENGTH                              0x1
#define _CLC6GLS1_G2D1T_MASK                                0x2
#define _CLC6GLS1_G2D2N_POSN                                0x2
#define _CLC6GLS1_G2D2N_POSITION                            0x2
#define _CLC6GLS1_G2D2N_SIZE                                0x1
#define _CLC6GLS1_G2D2N_LENGTH                              0x1
#define _CLC6GLS1_G2D2N_MASK                                0x4
#define _CLC6GLS1_G2D2T_POSN                                0x3
#define _CLC6GLS1_G2D2T_POSITION                            0x3
#define _CLC6GLS1_G2D2T_SIZE                                0x1
#define _CLC6GLS1_G2D2T_LENGTH                              0x1
#define _CLC6GLS1_G2D2T_MASK                                0x8
#define _CLC6GLS1_G2D3N_POSN                                0x4
#define _CLC6GLS1_G2D3N_POSITION                            0x4
#define _CLC6GLS1_G2D3N_SIZE                                0x1
#define _CLC6GLS1_G2D3N_LENGTH                              0x1
#define _CLC6GLS1_G2D3N_MASK                                0x10
#define _CLC6GLS1_G2D3T_POSN                                0x5
#define _CLC6GLS1_G2D3T_POSITION                            0x5
#define _CLC6GLS1_G2D3T_SIZE                                0x1
#define _CLC6GLS1_G2D3T_LENGTH                              0x1
#define _CLC6GLS1_G2D3T_MASK                                0x20
#define _CLC6GLS1_G2D4N_POSN                                0x6
#define _CLC6GLS1_G2D4N_POSITION                            0x6
#define _CLC6GLS1_G2D4N_SIZE                                0x1
#define _CLC6GLS1_G2D4N_LENGTH                              0x1
#define _CLC6GLS1_G2D4N_MASK                                0x40
#define _CLC6GLS1_G2D4T_POSN                                0x7
#define _CLC6GLS1_G2D4T_POSITION                            0x7
#define _CLC6GLS1_G2D4T_SIZE                                0x1
#define _CLC6GLS1_G2D4T_LENGTH                              0x1
#define _CLC6GLS1_G2D4T_MASK                                0x80
#define _CLC6GLS1_LC6G2D1N_POSN                             0x0
#define _CLC6GLS1_LC6G2D1N_POSITION                         0x0
#define _CLC6GLS1_LC6G2D1N_SIZE                             0x1
#define _CLC6GLS1_LC6G2D1N_LENGTH                           0x1
#define _CLC6GLS1_LC6G2D1N_MASK                             0x1
#define _CLC6GLS1_LC6G2D1T_POSN                             0x1
#define _CLC6GLS1_LC6G2D1T_POSITION                         0x1
#define _CLC6GLS1_LC6G2D1T_SIZE                             0x1
#define _CLC6GLS1_LC6G2D1T_LENGTH                           0x1
#define _CLC6GLS1_LC6G2D1T_MASK                             0x2
#define _CLC6GLS1_LC6G2D2N_POSN                             0x2
#define _CLC6GLS1_LC6G2D2N_POSITION                         0x2
#define _CLC6GLS1_LC6G2D2N_SIZE                             0x1
#define _CLC6GLS1_LC6G2D2N_LENGTH                           0x1
#define _CLC6GLS1_LC6G2D2N_MASK                             0x4
#define _CLC6GLS1_LC6G2D2T_POSN                             0x3
#define _CLC6GLS1_LC6G2D2T_POSITION                         0x3
#define _CLC6GLS1_LC6G2D2T_SIZE                             0x1
#define _CLC6GLS1_LC6G2D2T_LENGTH                           0x1
#define _CLC6GLS1_LC6G2D2T_MASK                             0x8
#define _CLC6GLS1_LC6G2D3N_POSN                             0x4
#define _CLC6GLS1_LC6G2D3N_POSITION                         0x4
#define _CLC6GLS1_LC6G2D3N_SIZE                             0x1
#define _CLC6GLS1_LC6G2D3N_LENGTH                           0x1
#define _CLC6GLS1_LC6G2D3N_MASK                             0x10
#define _CLC6GLS1_LC6G2D3T_POSN                             0x5
#define _CLC6GLS1_LC6G2D3T_POSITION                         0x5
#define _CLC6GLS1_LC6G2D3T_SIZE                             0x1
#define _CLC6GLS1_LC6G2D3T_LENGTH                           0x1
#define _CLC6GLS1_LC6G2D3T_MASK                             0x20
#define _CLC6GLS1_LC6G2D4N_POSN                             0x6
#define _CLC6GLS1_LC6G2D4N_POSITION                         0x6
#define _CLC6GLS1_LC6G2D4N_SIZE                             0x1
#define _CLC6GLS1_LC6G2D4N_LENGTH                           0x1
#define _CLC6GLS1_LC6G2D4N_MASK                             0x40
#define _CLC6GLS1_LC6G2D4T_POSN                             0x7
#define _CLC6GLS1_LC6G2D4T_POSITION                         0x7
#define _CLC6GLS1_LC6G2D4T_SIZE                             0x1
#define _CLC6GLS1_LC6G2D4T_LENGTH                           0x1
#define _CLC6GLS1_LC6G2D4T_MASK                             0x80

