MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
// Register: CLC6GLS2
#define CLC6GLS2 CLC6GLS2
extern volatile unsigned char           CLC6GLS2            __at(0xE61);
#ifndef _LIB_BUILD
asm("CLC6GLS2 equ 0E61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G3D1N                  :1;
        unsigned G3D1T                  :1;
        unsigned G3D2N                  :1;
        unsigned G3D2T                  :1;
        unsigned G3D3N                  :1;
        unsigned G3D3T                  :1;
        unsigned G3D4N                  :1;
        unsigned G3D4T                  :1;
    };
    struct {
        unsigned LC6G3D1N               :1;
        unsigned LC6G3D1T               :1;
        unsigned LC6G3D2N               :1;
        unsigned LC6G3D2T               :1;
        unsigned LC6G3D3N               :1;
        unsigned LC6G3D3T               :1;
        unsigned LC6G3D4N               :1;
        unsigned LC6G3D4T               :1;
    };
} CLC6GLS2bits_t;
extern volatile CLC6GLS2bits_t CLC6GLS2bits __at(0xE61);
// bitfield macros
#define _CLC6GLS2_G3D1N_POSN                                0x0
#define _CLC6GLS2_G3D1N_POSITION                            0x0
#define _CLC6GLS2_G3D1N_SIZE                                0x1
#define _CLC6GLS2_G3D1N_LENGTH                              0x1
#define _CLC6GLS2_G3D1N_MASK                                0x1
#define _CLC6GLS2_G3D1T_POSN                                0x1
#define _CLC6GLS2_G3D1T_POSITION                            0x1
#define _CLC6GLS2_G3D1T_SIZE                                0x1
#define _CLC6GLS2_G3D1T_LENGTH                              0x1
#define _CLC6GLS2_G3D1T_MASK                                0x2
#define _CLC6GLS2_G3D2N_POSN                                0x2
#define _CLC6GLS2_G3D2N_POSITION                            0x2
#define _CLC6GLS2_G3D2N_SIZE                                0x1
#define _CLC6GLS2_G3D2N_LENGTH                              0x1
#define _CLC6GLS2_G3D2N_MASK                                0x4
#define _CLC6GLS2_G3D2T_POSN                                0x3
#define _CLC6GLS2_G3D2T_POSITION                            0x3
#define _CLC6GLS2_G3D2T_SIZE                                0x1
#define _CLC6GLS2_G3D2T_LENGTH                              0x1
#define _CLC6GLS2_G3D2T_MASK                                0x8
#define _CLC6GLS2_G3D3N_POSN                                0x4
#define _CLC6GLS2_G3D3N_POSITION                            0x4
#define _CLC6GLS2_G3D3N_SIZE                                0x1
#define _CLC6GLS2_G3D3N_LENGTH                              0x1
#define _CLC6GLS2_G3D3N_MASK                                0x10
#define _CLC6GLS2_G3D3T_POSN                                0x5
#define _CLC6GLS2_G3D3T_POSITION                            0x5
#define _CLC6GLS2_G3D3T_SIZE                                0x1
#define _CLC6GLS2_G3D3T_LENGTH                              0x1
#define _CLC6GLS2_G3D3T_MASK                                0x20
#define _CLC6GLS2_G3D4N_POSN                                0x6
#define _CLC6GLS2_G3D4N_POSITION                            0x6
#define _CLC6GLS2_G3D4N_SIZE                                0x1
#define _CLC6GLS2_G3D4N_LENGTH                              0x1
#define _CLC6GLS2_G3D4N_MASK                                0x40
#define _CLC6GLS2_G3D4T_POSN                                0x7
#define _CLC6GLS2_G3D4T_POSITION                            0x7
#define _CLC6GLS2_G3D4T_SIZE                                0x1
#define _CLC6GLS2_G3D4T_LENGTH                              0x1
#define _CLC6GLS2_G3D4T_MASK                                0x80
#define _CLC6GLS2_LC6G3D1N_POSN                             0x0
#define _CLC6GLS2_LC6G3D1N_POSITION                         0x0
#define _CLC6GLS2_LC6G3D1N_SIZE                             0x1
#define _CLC6GLS2_LC6G3D1N_LENGTH                           0x1
#define _CLC6GLS2_LC6G3D1N_MASK                             0x1
#define _CLC6GLS2_LC6G3D1T_POSN                             0x1
#define _CLC6GLS2_LC6G3D1T_POSITION                         0x1
#define _CLC6GLS2_LC6G3D1T_SIZE                             0x1
#define _CLC6GLS2_LC6G3D1T_LENGTH                           0x1
#define _CLC6GLS2_LC6G3D1T_MASK                             0x2
#define _CLC6GLS2_LC6G3D2N_POSN                             0x2
#define _CLC6GLS2_LC6G3D2N_POSITION                         0x2
#define _CLC6GLS2_LC6G3D2N_SIZE                             0x1
#define _CLC6GLS2_LC6G3D2N_LENGTH                           0x1
#define _CLC6GLS2_LC6G3D2N_MASK                             0x4
#define _CLC6GLS2_LC6G3D2T_POSN                             0x3
#define _CLC6GLS2_LC6G3D2T_POSITION                         0x3
#define _CLC6GLS2_LC6G3D2T_SIZE                             0x1
#define _CLC6GLS2_LC6G3D2T_LENGTH                           0x1
#define _CLC6GLS2_LC6G3D2T_MASK                             0x8
#define _CLC6GLS2_LC6G3D3N_POSN                             0x4
#define _CLC6GLS2_LC6G3D3N_POSITION                         0x4
#define _CLC6GLS2_LC6G3D3N_SIZE                             0x1
#define _CLC6GLS2_LC6G3D3N_LENGTH                           0x1
#define _CLC6GLS2_LC6G3D3N_MASK                             0x10
#define _CLC6GLS2_LC6G3D3T_POSN                             0x5
#define _CLC6GLS2_LC6G3D3T_POSITION                         0x5
#define _CLC6GLS2_LC6G3D3T_SIZE                             0x1
#define _CLC6GLS2_LC6G3D3T_LENGTH                           0x1
#define _CLC6GLS2_LC6G3D3T_MASK                             0x20
#define _CLC6GLS2_LC6G3D4N_POSN                             0x6
#define _CLC6GLS2_LC6G3D4N_POSITION                         0x6
#define _CLC6GLS2_LC6G3D4N_SIZE                             0x1
#define _CLC6GLS2_LC6G3D4N_LENGTH                           0x1
#define _CLC6GLS2_LC6G3D4N_MASK                             0x40
#define _CLC6GLS2_LC6G3D4T_POSN                             0x7
#define _CLC6GLS2_LC6G3D4T_POSITION                         0x7
#define _CLC6GLS2_LC6G3D4T_SIZE                             0x1
#define _CLC6GLS2_LC6G3D4T_LENGTH                           0x1
#define _CLC6GLS2_LC6G3D4T_MASK                             0x80

// Register: CLC6GLS3
#define CLC6GLS3 CLC6GLS3
extern volatile unsigned char           CLC6GLS3            __at(0xE62);
#ifndef _LIB_BUILD
asm("CLC6GLS3 equ 0E62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G4D1N                  :1;
        unsigned G4D1T                  :1;
        unsigned G4D2N                  :1;
        unsigned G4D2T                  :1;
        unsigned G4D3N                  :1;
        unsigned G4D3T                  :1;
        unsigned G4D4N                  :1;
        unsigned G4D4T                  :1;
    };
    struct {
        unsigned LC6G4D1N               :1;
        unsigned LC6G4D1T               :1;
        unsigned LC6G4D2N               :1;
        unsigned LC6G4D2T               :1;
        unsigned LC6G4D3N               :1;
        unsigned LC6G4D3T               :1;
        unsigned LC6G4D4N               :1;
        unsigned LC6G4D4T               :1;
    };
} CLC6GLS3bits_t;
extern volatile CLC6GLS3bits_t CLC6GLS3bits __at(0xE62);
// bitfield macros
#define _CLC6GLS3_G4D1N_POSN                                0x0
#define _CLC6GLS3_G4D1N_POSITION                            0x0
#define _CLC6GLS3_G4D1N_SIZE                                0x1
#define _CLC6GLS3_G4D1N_LENGTH                              0x1
#define _CLC6GLS3_G4D1N_MASK                                0x1
#define _CLC6GLS3_G4D1T_POSN                                0x1
#define _CLC6GLS3_G4D1T_POSITION                            0x1
#define _CLC6GLS3_G4D1T_SIZE                                0x1
#define _CLC6GLS3_G4D1T_LENGTH                              0x1
#define _CLC6GLS3_G4D1T_MASK                                0x2
#define _CLC6GLS3_G4D2N_POSN                                0x2
#define _CLC6GLS3_G4D2N_POSITION                            0x2
#define _CLC6GLS3_G4D2N_SIZE                                0x1
#define _CLC6GLS3_G4D2N_LENGTH                              0x1
#define _CLC6GLS3_G4D2N_MASK                                0x4
#define _CLC6GLS3_G4D2T_POSN                                0x3
#define _CLC6GLS3_G4D2T_POSITION                            0x3
#define _CLC6GLS3_G4D2T_SIZE                                0x1
#define _CLC6GLS3_G4D2T_LENGTH                              0x1
#define _CLC6GLS3_G4D2T_MASK                                0x8
#define _CLC6GLS3_G4D3N_POSN                                0x4
#define _CLC6GLS3_G4D3N_POSITION                            0x4
#define _CLC6GLS3_G4D3N_SIZE                                0x1
#define _CLC6GLS3_G4D3N_LENGTH                              0x1
#define _CLC6GLS3_G4D3N_MASK                                0x10
#define _CLC6GLS3_G4D3T_POSN                                0x5
#define _CLC6GLS3_G4D3T_POSITION                            0x5
#define _CLC6GLS3_G4D3T_SIZE                                0x1
#define _CLC6GLS3_G4D3T_LENGTH                              0x1
#define _CLC6GLS3_G4D3T_MASK                                0x20
#define _CLC6GLS3_G4D4N_POSN                                0x6
#define _CLC6GLS3_G4D4N_POSITION                            0x6
#define _CLC6GLS3_G4D4N_SIZE                                0x1
#define _CLC6GLS3_G4D4N_LENGTH                              0x1
#define _CLC6GLS3_G4D4N_MASK                                0x40
#define _CLC6GLS3_G4D4T_POSN                                0x7
#define _CLC6GLS3_G4D4T_POSITION                            0x7
#define _CLC6GLS3_G4D4T_SIZE                                0x1
#define _CLC6GLS3_G4D4T_LENGTH                              0x1
#define _CLC6GLS3_G4D4T_MASK                                0x80
#define _CLC6GLS3_LC6G4D1N_POSN                             0x0
#define _CLC6GLS3_LC6G4D1N_POSITION                         0x0
#define _CLC6GLS3_LC6G4D1N_SIZE                             0x1
#define _CLC6GLS3_LC6G4D1N_LENGTH                           0x1
#define _CLC6GLS3_LC6G4D1N_MASK                             0x1
#define _CLC6GLS3_LC6G4D1T_POSN                             0x1
#define _CLC6GLS3_LC6G4D1T_POSITION                         0x1
#define _CLC6GLS3_LC6G4D1T_SIZE                             0x1
#define _CLC6GLS3_LC6G4D1T_LENGTH                           0x1
#define _CLC6GLS3_LC6G4D1T_MASK                             0x2
#define _CLC6GLS3_LC6G4D2N_POSN                             0x2
#define _CLC6GLS3_LC6G4D2N_POSITION                         0x2
#define _CLC6GLS3_LC6G4D2N_SIZE                             0x1
#define _CLC6GLS3_LC6G4D2N_LENGTH                           0x1
#define _CLC6GLS3_LC6G4D2N_MASK                             0x4
#define _CLC6GLS3_LC6G4D2T_POSN                             0x3
#define _CLC6GLS3_LC6G4D2T_POSITION                         0x3
#define _CLC6GLS3_LC6G4D2T_SIZE                             0x1
#define _CLC6GLS3_LC6G4D2T_LENGTH                           0x1
#define _CLC6GLS3_LC6G4D2T_MASK                             0x8
#define _CLC6GLS3_LC6G4D3N_POSN                             0x4
#define _CLC6GLS3_LC6G4D3N_POSITION                         0x4
#define _CLC6GLS3_LC6G4D3N_SIZE                             0x1
#define _CLC6GLS3_LC6G4D3N_LENGTH                           0x1
#define _CLC6GLS3_LC6G4D3N_MASK                             0x10
#define _CLC6GLS3_LC6G4D3T_POSN                             0x5
#define _CLC6GLS3_LC6G4D3T_POSITION                         0x5
#define _CLC6GLS3_LC6G4D3T_SIZE                             0x1
#define _CLC6GLS3_LC6G4D3T_LENGTH                           0x1
#define _CLC6GLS3_LC6G4D3T_MASK                             0x20
#define _CLC6GLS3_LC6G4D4N_POSN                             0x6
#define _CLC6GLS3_LC6G4D4N_POSITION                         0x6
#define _CLC6GLS3_LC6G4D4N_SIZE                             0x1
#define _CLC6GLS3_LC6G4D4N_LENGTH                           0x1
#define _CLC6GLS3_LC6G4D4N_MASK                             0x40
#define _CLC6GLS3_LC6G4D4T_POSN                             0x7
#define _CLC6GLS3_LC6G4D4T_POSITION                         0x7
#define _CLC6GLS3_LC6G4D4T_SIZE                             0x1
#define _CLC6GLS3_LC6G4D4T_LENGTH                           0x1
#define _CLC6GLS3_LC6G4D4T_MASK                             0x80

