MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
// Register: CLC7CON
#define CLC7CON CLC7CON
extern volatile unsigned char           CLC7CON             __at(0xE63);
#ifndef _LIB_BUILD
asm("CLC7CON equ 0E63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned LC7MODE                :3;
        unsigned LC7INTN                :1;
        unsigned LC7INTP                :1;
        unsigned LC7OUT                 :1;
        unsigned                        :1;
        unsigned LC7EN                  :1;
    };
    struct {
        unsigned LC7MODE0               :1;
        unsigned LC7MODE1               :1;
        unsigned LC7MODE2               :1;
    };
} CLC7CONbits_t;
extern volatile CLC7CONbits_t CLC7CONbits __at(0xE63);
// bitfield macros
#define _CLC7CON_MODE_POSN                                  0x0
#define _CLC7CON_MODE_POSITION                              0x0
#define _CLC7CON_MODE_SIZE                                  0x3
#define _CLC7CON_MODE_LENGTH                                0x3
#define _CLC7CON_MODE_MASK                                  0x7
#define _CLC7CON_INTN_POSN                                  0x3
#define _CLC7CON_INTN_POSITION                              0x3
#define _CLC7CON_INTN_SIZE                                  0x1
#define _CLC7CON_INTN_LENGTH                                0x1
#define _CLC7CON_INTN_MASK                                  0x8
#define _CLC7CON_INTP_POSN                                  0x4
#define _CLC7CON_INTP_POSITION                              0x4
#define _CLC7CON_INTP_SIZE                                  0x1
#define _CLC7CON_INTP_LENGTH                                0x1
#define _CLC7CON_INTP_MASK                                  0x10
#define _CLC7CON_OUT_POSN                                   0x5
#define _CLC7CON_OUT_POSITION                               0x5
#define _CLC7CON_OUT_SIZE                                   0x1
#define _CLC7CON_OUT_LENGTH                                 0x1
#define _CLC7CON_OUT_MASK                                   0x20
#define _CLC7CON_EN_POSN                                    0x7
#define _CLC7CON_EN_POSITION                                0x7
#define _CLC7CON_EN_SIZE                                    0x1
#define _CLC7CON_EN_LENGTH                                  0x1
#define _CLC7CON_EN_MASK                                    0x80
#define _CLC7CON_MODE0_POSN                                 0x0
#define _CLC7CON_MODE0_POSITION                             0x0
#define _CLC7CON_MODE0_SIZE                                 0x1
#define _CLC7CON_MODE0_LENGTH                               0x1
#define _CLC7CON_MODE0_MASK                                 0x1
#define _CLC7CON_MODE1_POSN                                 0x1
#define _CLC7CON_MODE1_POSITION                             0x1
#define _CLC7CON_MODE1_SIZE                                 0x1
#define _CLC7CON_MODE1_LENGTH                               0x1
#define _CLC7CON_MODE1_MASK                                 0x2
#define _CLC7CON_MODE2_POSN                                 0x2
#define _CLC7CON_MODE2_POSITION                             0x2
#define _CLC7CON_MODE2_SIZE                                 0x1
#define _CLC7CON_MODE2_LENGTH                               0x1
#define _CLC7CON_MODE2_MASK                                 0x4
#define _CLC7CON_LC7MODE_POSN                               0x0
#define _CLC7CON_LC7MODE_POSITION                           0x0
#define _CLC7CON_LC7MODE_SIZE                               0x3
#define _CLC7CON_LC7MODE_LENGTH                             0x3
#define _CLC7CON_LC7MODE_MASK                               0x7
#define _CLC7CON_LC7INTN_POSN                               0x3
#define _CLC7CON_LC7INTN_POSITION                           0x3
#define _CLC7CON_LC7INTN_SIZE                               0x1
#define _CLC7CON_LC7INTN_LENGTH                             0x1
#define _CLC7CON_LC7INTN_MASK                               0x8
#define _CLC7CON_LC7INTP_POSN                               0x4
#define _CLC7CON_LC7INTP_POSITION                           0x4
#define _CLC7CON_LC7INTP_SIZE                               0x1
#define _CLC7CON_LC7INTP_LENGTH                             0x1
#define _CLC7CON_LC7INTP_MASK                               0x10
#define _CLC7CON_LC7OUT_POSN                                0x5
#define _CLC7CON_LC7OUT_POSITION                            0x5
#define _CLC7CON_LC7OUT_SIZE                                0x1
#define _CLC7CON_LC7OUT_LENGTH                              0x1
#define _CLC7CON_LC7OUT_MASK                                0x20
#define _CLC7CON_LC7EN_POSN                                 0x7
#define _CLC7CON_LC7EN_POSITION                             0x7
#define _CLC7CON_LC7EN_SIZE                                 0x1
#define _CLC7CON_LC7EN_LENGTH                               0x1
#define _CLC7CON_LC7EN_MASK                                 0x80
#define _CLC7CON_LC7MODE0_POSN                              0x0
#define _CLC7CON_LC7MODE0_POSITION                          0x0
#define _CLC7CON_LC7MODE0_SIZE                              0x1
#define _CLC7CON_LC7MODE0_LENGTH                            0x1
#define _CLC7CON_LC7MODE0_MASK                              0x1
#define _CLC7CON_LC7MODE1_POSN                              0x1
#define _CLC7CON_LC7MODE1_POSITION                          0x1
#define _CLC7CON_LC7MODE1_SIZE                              0x1
#define _CLC7CON_LC7MODE1_LENGTH                            0x1
#define _CLC7CON_LC7MODE1_MASK                              0x2
#define _CLC7CON_LC7MODE2_POSN                              0x2
#define _CLC7CON_LC7MODE2_POSITION                          0x2
#define _CLC7CON_LC7MODE2_SIZE                              0x1
#define _CLC7CON_LC7MODE2_LENGTH                            0x1
#define _CLC7CON_LC7MODE2_MASK                              0x4

// Register: CLC7POL
#define CLC7POL CLC7POL
extern volatile unsigned char           CLC7POL             __at(0xE64);
#ifndef _LIB_BUILD
asm("CLC7POL equ 0E64h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
    struct {
        unsigned LC7G1POL               :1;
        unsigned LC7G2POL               :1;
        unsigned LC7G3POL               :1;
        unsigned LC7G4POL               :1;
        unsigned                        :3;
        unsigned LC7POL                 :1;
    };
} CLC7POLbits_t;
extern volatile CLC7POLbits_t CLC7POLbits __at(0xE64);
// bitfield macros
#define _CLC7POL_G1POL_POSN                                 0x0
#define _CLC7POL_G1POL_POSITION                             0x0
#define _CLC7POL_G1POL_SIZE                                 0x1
#define _CLC7POL_G1POL_LENGTH                               0x1
#define _CLC7POL_G1POL_MASK                                 0x1
#define _CLC7POL_G2POL_POSN                                 0x1
#define _CLC7POL_G2POL_POSITION                             0x1
#define _CLC7POL_G2POL_SIZE                                 0x1
#define _CLC7POL_G2POL_LENGTH                               0x1
#define _CLC7POL_G2POL_MASK                                 0x2
#define _CLC7POL_G3POL_POSN                                 0x2
#define _CLC7POL_G3POL_POSITION                             0x2
#define _CLC7POL_G3POL_SIZE                                 0x1
#define _CLC7POL_G3POL_LENGTH                               0x1
#define _CLC7POL_G3POL_MASK                                 0x4
#define _CLC7POL_G4POL_POSN                                 0x3
#define _CLC7POL_G4POL_POSITION                             0x3
#define _CLC7POL_G4POL_SIZE                                 0x1
#define _CLC7POL_G4POL_LENGTH                               0x1
#define _CLC7POL_G4POL_MASK                                 0x8
#define _CLC7POL_POL_POSN                                   0x7
#define _CLC7POL_POL_POSITION                               0x7
#define _CLC7POL_POL_SIZE                                   0x1
#define _CLC7POL_POL_LENGTH                                 0x1
#define _CLC7POL_POL_MASK                                   0x80
#define _CLC7POL_LC7G1POL_POSN                              0x0
#define _CLC7POL_LC7G1POL_POSITION                          0x0
#define _CLC7POL_LC7G1POL_SIZE                              0x1
#define _CLC7POL_LC7G1POL_LENGTH                            0x1
#define _CLC7POL_LC7G1POL_MASK                              0x1
#define _CLC7POL_LC7G2POL_POSN                              0x1
#define _CLC7POL_LC7G2POL_POSITION                          0x1
#define _CLC7POL_LC7G2POL_SIZE                              0x1
#define _CLC7POL_LC7G2POL_LENGTH                            0x1
#define _CLC7POL_LC7G2POL_MASK                              0x2
#define _CLC7POL_LC7G3POL_POSN                              0x2
#define _CLC7POL_LC7G3POL_POSITION                          0x2
#define _CLC7POL_LC7G3POL_SIZE                              0x1
#define _CLC7POL_LC7G3POL_LENGTH                            0x1
#define _CLC7POL_LC7G3POL_MASK                              0x4
#define _CLC7POL_LC7G4POL_POSN                              0x3
#define _CLC7POL_LC7G4POL_POSITION                          0x3
#define _CLC7POL_LC7G4POL_SIZE                              0x1
#define _CLC7POL_LC7G4POL_LENGTH                            0x1
#define _CLC7POL_LC7G4POL_MASK                              0x8
#define _CLC7POL_LC7POL_POSN                                0x7
#define _CLC7POL_LC7POL_POSITION                            0x7
#define _CLC7POL_LC7POL_SIZE                                0x1
#define _CLC7POL_LC7POL_LENGTH                              0x1
#define _CLC7POL_LC7POL_MASK                                0x80

// Register: CLC7SEL0
#define CLC7SEL0 CLC7SEL0
extern volatile unsigned char           CLC7SEL0            __at(0xE65);
#ifndef _LIB_BUILD
asm("CLC7SEL0 equ 0E65h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D1S                    :8;
    };
    struct {
        unsigned LC7D1S                 :8;
    };
    struct {
        unsigned D1S0                   :1;
        unsigned D1S1                   :1;
        unsigned D1S2                   :1;
        unsigned D1S3                   :1;
        unsigned D1S4                   :1;
        unsigned D1S5                   :1;
        unsigned D1S6                   :1;
        unsigned D1S7                   :1;
    };
    struct {
        unsigned LC7D1S0                :1;
        unsigned LC7D1S1                :1;
        unsigned LC7D1S2                :1;
        unsigned LC7D1S3                :1;
        unsigned LC7D1S4                :1;
        unsigned LC7D1S5                :1;
        unsigned LC7D1S6                :1;
        unsigned LC7D1S7                :1;
    };
} CLC7SEL0bits_t;
extern volatile CLC7SEL0bits_t CLC7SEL0bits __at(0xE65);
// bitfield macros
#define _CLC7SEL0_D1S_POSN                                  0x0
#define _CLC7SEL0_D1S_POSITION                              0x0
#define _CLC7SEL0_D1S_SIZE                                  0x8
#define _CLC7SEL0_D1S_LENGTH                                0x8
#define _CLC7SEL0_D1S_MASK                                  0xFF
#define _CLC7SEL0_LC7D1S_POSN                               0x0
#define _CLC7SEL0_LC7D1S_POSITION                           0x0
#define _CLC7SEL0_LC7D1S_SIZE                               0x8
#define _CLC7SEL0_LC7D1S_LENGTH                             0x8
#define _CLC7SEL0_LC7D1S_MASK                               0xFF
#define _CLC7SEL0_D1S0_POSN                                 0x0
#define _CLC7SEL0_D1S0_POSITION                             0x0
#define _CLC7SEL0_D1S0_SIZE                                 0x1
#define _CLC7SEL0_D1S0_LENGTH                               0x1
#define _CLC7SEL0_D1S0_MASK                                 0x1
#define _CLC7SEL0_D1S1_POSN                                 0x1
#define _CLC7SEL0_D1S1_POSITION                             0x1
#define _CLC7SEL0_D1S1_SIZE                                 0x1
#define _CLC7SEL0_D1S1_LENGTH                               0x1
#define _CLC7SEL0_D1S1_MASK                                 0x2
#define _CLC7SEL0_D1S2_POSN                                 0x2
#define _CLC7SEL0_D1S2_POSITION                             0x2
#define _CLC7SEL0_D1S2_SIZE                                 0x1
#define _CLC7SEL0_D1S2_LENGTH                               0x1
#define _CLC7SEL0_D1S2_MASK                                 0x4
#define _CLC7SEL0_D1S3_POSN                                 0x3
#define _CLC7SEL0_D1S3_POSITION                             0x3
#define _CLC7SEL0_D1S3_SIZE                                 0x1
#define _CLC7SEL0_D1S3_LENGTH                               0x1
#define _CLC7SEL0_D1S3_MASK                                 0x8
#define _CLC7SEL0_D1S4_POSN                                 0x4
#define _CLC7SEL0_D1S4_POSITION                             0x4
#define _CLC7SEL0_D1S4_SIZE                                 0x1
#define _CLC7SEL0_D1S4_LENGTH                               0x1
#define _CLC7SEL0_D1S4_MASK                                 0x10
#define _CLC7SEL0_D1S5_POSN                                 0x5
#define _CLC7SEL0_D1S5_POSITION                             0x5
#define _CLC7SEL0_D1S5_SIZE                                 0x1
#define _CLC7SEL0_D1S5_LENGTH                               0x1
#define _CLC7SEL0_D1S5_MASK                                 0x20
#define _CLC7SEL0_D1S6_POSN                                 0x6
#define _CLC7SEL0_D1S6_POSITION                             0x6
#define _CLC7SEL0_D1S6_SIZE                                 0x1
#define _CLC7SEL0_D1S6_LENGTH                               0x1
#define _CLC7SEL0_D1S6_MASK                                 0x40
#define _CLC7SEL0_D1S7_POSN                                 0x7
#define _CLC7SEL0_D1S7_POSITION                             0x7
#define _CLC7SEL0_D1S7_SIZE                                 0x1
#define _CLC7SEL0_D1S7_LENGTH                               0x1
#define _CLC7SEL0_D1S7_MASK                                 0x80
#define _CLC7SEL0_LC7D1S0_POSN                              0x0
#define _CLC7SEL0_LC7D1S0_POSITION                          0x0
#define _CLC7SEL0_LC7D1S0_SIZE                              0x1
#define _CLC7SEL0_LC7D1S0_LENGTH                            0x1
#define _CLC7SEL0_LC7D1S0_MASK                              0x1
#define _CLC7SEL0_LC7D1S1_POSN                              0x1
#define _CLC7SEL0_LC7D1S1_POSITION                          0x1
#define _CLC7SEL0_LC7D1S1_SIZE                              0x1
#define _CLC7SEL0_LC7D1S1_LENGTH                            0x1
#define _CLC7SEL0_LC7D1S1_MASK                              0x2
#define _CLC7SEL0_LC7D1S2_POSN                              0x2
#define _CLC7SEL0_LC7D1S2_POSITION                          0x2
#define _CLC7SEL0_LC7D1S2_SIZE                              0x1
#define _CLC7SEL0_LC7D1S2_LENGTH                            0x1
#define _CLC7SEL0_LC7D1S2_MASK                              0x4
#define _CLC7SEL0_LC7D1S3_POSN                              0x3
#define _CLC7SEL0_LC7D1S3_POSITION                          0x3
#define _CLC7SEL0_LC7D1S3_SIZE                              0x1
#define _CLC7SEL0_LC7D1S3_LENGTH                            0x1
#define _CLC7SEL0_LC7D1S3_MASK                              0x8
#define _CLC7SEL0_LC7D1S4_POSN                              0x4
#define _CLC7SEL0_LC7D1S4_POSITION                          0x4
#define _CLC7SEL0_LC7D1S4_SIZE                              0x1
#define _CLC7SEL0_LC7D1S4_LENGTH                            0x1
#define _CLC7SEL0_LC7D1S4_MASK                              0x10
#define _CLC7SEL0_LC7D1S5_POSN                              0x5
#define _CLC7SEL0_LC7D1S5_POSITION                          0x5
#define _CLC7SEL0_LC7D1S5_SIZE                              0x1
#define _CLC7SEL0_LC7D1S5_LENGTH                            0x1
#define _CLC7SEL0_LC7D1S5_MASK                              0x20
#define _CLC7SEL0_LC7D1S6_POSN                              0x6
#define _CLC7SEL0_LC7D1S6_POSITION                          0x6
#define _CLC7SEL0_LC7D1S6_SIZE                              0x1
#define _CLC7SEL0_LC7D1S6_LENGTH                            0x1
#define _CLC7SEL0_LC7D1S6_MASK                              0x40
#define _CLC7SEL0_LC7D1S7_POSN                              0x7
#define _CLC7SEL0_LC7D1S7_POSITION                          0x7
#define _CLC7SEL0_LC7D1S7_SIZE                              0x1
#define _CLC7SEL0_LC7D1S7_LENGTH                            0x1
#define _CLC7SEL0_LC7D1S7_MASK                              0x80

// Register: CLC7SEL1
#define CLC7SEL1 CLC7SEL1
extern volatile unsigned char           CLC7SEL1            __at(0xE66);
#ifndef _LIB_BUILD
asm("CLC7SEL1 equ 0E66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D2S                    :8;
    };
    struct {
        unsigned LC7D2S                 :8;
    };
    struct {
        unsigned D2S0                   :1;
        unsigned D2S1                   :1;
        unsigned D2S2                   :1;
        unsigned D2S3                   :1;
        unsigned D2S4                   :1;
        unsigned D2S5                   :1;
        unsigned D2S6                   :1;
        unsigned D2S7                   :1;
    };
    struct {
        unsigned LC7D2S0                :1;
        unsigned LC7D2S1                :1;
        unsigned LC7D2S2                :1;
        unsigned LC7D2S3                :1;
        unsigned LC7D2S4                :1;
        unsigned LC7D2S5                :1;
        unsigned LC7D2S6                :1;
        unsigned LC7D2S7                :1;
    };
} CLC7SEL1bits_t;
