MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
// Register: CLC7GLS2
#define CLC7GLS2 CLC7GLS2
extern volatile unsigned char           CLC7GLS2            __at(0xE6B);
#ifndef _LIB_BUILD
asm("CLC7GLS2 equ 0E6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G3D1N                  :1;
        unsigned G3D1T                  :1;
        unsigned G3D2N                  :1;
        unsigned G3D2T                  :1;
        unsigned G3D3N                  :1;
        unsigned G3D3T                  :1;
        unsigned G3D4N                  :1;
        unsigned G3D4T                  :1;
    };
    struct {
        unsigned LC7G3D1N               :1;
        unsigned LC7G3D1T               :1;
        unsigned LC7G3D2N               :1;
        unsigned LC7G3D2T               :1;
        unsigned LC7G3D3N               :1;
        unsigned LC7G3D3T               :1;
        unsigned LC7G3D4N               :1;
        unsigned LC7G3D4T               :1;
    };
} CLC7GLS2bits_t;
extern volatile CLC7GLS2bits_t CLC7GLS2bits __at(0xE6B);
// bitfield macros
#define _CLC7GLS2_G3D1N_POSN                                0x0
#define _CLC7GLS2_G3D1N_POSITION                            0x0
#define _CLC7GLS2_G3D1N_SIZE                                0x1
#define _CLC7GLS2_G3D1N_LENGTH                              0x1
#define _CLC7GLS2_G3D1N_MASK                                0x1
#define _CLC7GLS2_G3D1T_POSN                                0x1
#define _CLC7GLS2_G3D1T_POSITION                            0x1
#define _CLC7GLS2_G3D1T_SIZE                                0x1
#define _CLC7GLS2_G3D1T_LENGTH                              0x1
#define _CLC7GLS2_G3D1T_MASK                                0x2
#define _CLC7GLS2_G3D2N_POSN                                0x2
#define _CLC7GLS2_G3D2N_POSITION                            0x2
#define _CLC7GLS2_G3D2N_SIZE                                0x1
#define _CLC7GLS2_G3D2N_LENGTH                              0x1
#define _CLC7GLS2_G3D2N_MASK                                0x4
#define _CLC7GLS2_G3D2T_POSN                                0x3
#define _CLC7GLS2_G3D2T_POSITION                            0x3
#define _CLC7GLS2_G3D2T_SIZE                                0x1
#define _CLC7GLS2_G3D2T_LENGTH                              0x1
#define _CLC7GLS2_G3D2T_MASK                                0x8
#define _CLC7GLS2_G3D3N_POSN                                0x4
#define _CLC7GLS2_G3D3N_POSITION                            0x4
#define _CLC7GLS2_G3D3N_SIZE                                0x1
#define _CLC7GLS2_G3D3N_LENGTH                              0x1
#define _CLC7GLS2_G3D3N_MASK                                0x10
#define _CLC7GLS2_G3D3T_POSN                                0x5
#define _CLC7GLS2_G3D3T_POSITION                            0x5
#define _CLC7GLS2_G3D3T_SIZE                                0x1
#define _CLC7GLS2_G3D3T_LENGTH                              0x1
#define _CLC7GLS2_G3D3T_MASK                                0x20
#define _CLC7GLS2_G3D4N_POSN                                0x6
#define _CLC7GLS2_G3D4N_POSITION                            0x6
#define _CLC7GLS2_G3D4N_SIZE                                0x1
#define _CLC7GLS2_G3D4N_LENGTH                              0x1
#define _CLC7GLS2_G3D4N_MASK                                0x40
#define _CLC7GLS2_G3D4T_POSN                                0x7
#define _CLC7GLS2_G3D4T_POSITION                            0x7
#define _CLC7GLS2_G3D4T_SIZE                                0x1
#define _CLC7GLS2_G3D4T_LENGTH                              0x1
#define _CLC7GLS2_G3D4T_MASK                                0x80
#define _CLC7GLS2_LC7G3D1N_POSN                             0x0
#define _CLC7GLS2_LC7G3D1N_POSITION                         0x0
#define _CLC7GLS2_LC7G3D1N_SIZE                             0x1
#define _CLC7GLS2_LC7G3D1N_LENGTH                           0x1
#define _CLC7GLS2_LC7G3D1N_MASK                             0x1
#define _CLC7GLS2_LC7G3D1T_POSN                             0x1
#define _CLC7GLS2_LC7G3D1T_POSITION                         0x1
#define _CLC7GLS2_LC7G3D1T_SIZE                             0x1
#define _CLC7GLS2_LC7G3D1T_LENGTH                           0x1
#define _CLC7GLS2_LC7G3D1T_MASK                             0x2
#define _CLC7GLS2_LC7G3D2N_POSN                             0x2
#define _CLC7GLS2_LC7G3D2N_POSITION                         0x2
#define _CLC7GLS2_LC7G3D2N_SIZE                             0x1
#define _CLC7GLS2_LC7G3D2N_LENGTH                           0x1
#define _CLC7GLS2_LC7G3D2N_MASK                             0x4
#define _CLC7GLS2_LC7G3D2T_POSN                             0x3
#define _CLC7GLS2_LC7G3D2T_POSITION                         0x3
#define _CLC7GLS2_LC7G3D2T_SIZE                             0x1
#define _CLC7GLS2_LC7G3D2T_LENGTH                           0x1
#define _CLC7GLS2_LC7G3D2T_MASK                             0x8
#define _CLC7GLS2_LC7G3D3N_POSN                             0x4
#define _CLC7GLS2_LC7G3D3N_POSITION                         0x4
#define _CLC7GLS2_LC7G3D3N_SIZE                             0x1
#define _CLC7GLS2_LC7G3D3N_LENGTH                           0x1
#define _CLC7GLS2_LC7G3D3N_MASK                             0x10
#define _CLC7GLS2_LC7G3D3T_POSN                             0x5
#define _CLC7GLS2_LC7G3D3T_POSITION                         0x5
#define _CLC7GLS2_LC7G3D3T_SIZE                             0x1
#define _CLC7GLS2_LC7G3D3T_LENGTH                           0x1
#define _CLC7GLS2_LC7G3D3T_MASK                             0x20
#define _CLC7GLS2_LC7G3D4N_POSN                             0x6
#define _CLC7GLS2_LC7G3D4N_POSITION                         0x6
#define _CLC7GLS2_LC7G3D4N_SIZE                             0x1
#define _CLC7GLS2_LC7G3D4N_LENGTH                           0x1
#define _CLC7GLS2_LC7G3D4N_MASK                             0x40
#define _CLC7GLS2_LC7G3D4T_POSN                             0x7
#define _CLC7GLS2_LC7G3D4T_POSITION                         0x7
#define _CLC7GLS2_LC7G3D4T_SIZE                             0x1
#define _CLC7GLS2_LC7G3D4T_LENGTH                           0x1
#define _CLC7GLS2_LC7G3D4T_MASK                             0x80

// Register: CLC7GLS3
#define CLC7GLS3 CLC7GLS3
extern volatile unsigned char           CLC7GLS3            __at(0xE6C);
#ifndef _LIB_BUILD
asm("CLC7GLS3 equ 0E6Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G4D1N                  :1;
        unsigned G4D1T                  :1;
        unsigned G4D2N                  :1;
        unsigned G4D2T                  :1;
        unsigned G4D3N                  :1;
        unsigned G4D3T                  :1;
        unsigned G4D4N                  :1;
        unsigned G4D4T                  :1;
    };
    struct {
        unsigned LC7G4D1N               :1;
        unsigned LC7G4D1T               :1;
        unsigned LC7G4D2N               :1;
        unsigned LC7G4D2T               :1;
        unsigned LC7G4D3N               :1;
        unsigned LC7G4D3T               :1;
        unsigned LC7G4D4N               :1;
        unsigned LC7G4D4T               :1;
    };
} CLC7GLS3bits_t;
extern volatile CLC7GLS3bits_t CLC7GLS3bits __at(0xE6C);
// bitfield macros
#define _CLC7GLS3_G4D1N_POSN                                0x0
#define _CLC7GLS3_G4D1N_POSITION                            0x0
#define _CLC7GLS3_G4D1N_SIZE                                0x1
#define _CLC7GLS3_G4D1N_LENGTH                              0x1
#define _CLC7GLS3_G4D1N_MASK                                0x1
#define _CLC7GLS3_G4D1T_POSN                                0x1
#define _CLC7GLS3_G4D1T_POSITION                            0x1
#define _CLC7GLS3_G4D1T_SIZE                                0x1
#define _CLC7GLS3_G4D1T_LENGTH                              0x1
#define _CLC7GLS3_G4D1T_MASK                                0x2
#define _CLC7GLS3_G4D2N_POSN                                0x2
#define _CLC7GLS3_G4D2N_POSITION                            0x2
#define _CLC7GLS3_G4D2N_SIZE                                0x1
#define _CLC7GLS3_G4D2N_LENGTH                              0x1
#define _CLC7GLS3_G4D2N_MASK                                0x4
#define _CLC7GLS3_G4D2T_POSN                                0x3
#define _CLC7GLS3_G4D2T_POSITION                            0x3
#define _CLC7GLS3_G4D2T_SIZE                                0x1
#define _CLC7GLS3_G4D2T_LENGTH                              0x1
#define _CLC7GLS3_G4D2T_MASK                                0x8
#define _CLC7GLS3_G4D3N_POSN                                0x4
#define _CLC7GLS3_G4D3N_POSITION                            0x4
#define _CLC7GLS3_G4D3N_SIZE                                0x1
#define _CLC7GLS3_G4D3N_LENGTH                              0x1
#define _CLC7GLS3_G4D3N_MASK                                0x10
#define _CLC7GLS3_G4D3T_POSN                                0x5
#define _CLC7GLS3_G4D3T_POSITION                            0x5
#define _CLC7GLS3_G4D3T_SIZE                                0x1
#define _CLC7GLS3_G4D3T_LENGTH                              0x1
#define _CLC7GLS3_G4D3T_MASK                                0x20
#define _CLC7GLS3_G4D4N_POSN                                0x6
#define _CLC7GLS3_G4D4N_POSITION                            0x6
#define _CLC7GLS3_G4D4N_SIZE                                0x1
#define _CLC7GLS3_G4D4N_LENGTH                              0x1
#define _CLC7GLS3_G4D4N_MASK                                0x40
#define _CLC7GLS3_G4D4T_POSN                                0x7
#define _CLC7GLS3_G4D4T_POSITION                            0x7
#define _CLC7GLS3_G4D4T_SIZE                                0x1
#define _CLC7GLS3_G4D4T_LENGTH                              0x1
#define _CLC7GLS3_G4D4T_MASK                                0x80
#define _CLC7GLS3_LC7G4D1N_POSN                             0x0
#define _CLC7GLS3_LC7G4D1N_POSITION                         0x0
#define _CLC7GLS3_LC7G4D1N_SIZE                             0x1
#define _CLC7GLS3_LC7G4D1N_LENGTH                           0x1
#define _CLC7GLS3_LC7G4D1N_MASK                             0x1
#define _CLC7GLS3_LC7G4D1T_POSN                             0x1
#define _CLC7GLS3_LC7G4D1T_POSITION                         0x1
#define _CLC7GLS3_LC7G4D1T_SIZE                             0x1
#define _CLC7GLS3_LC7G4D1T_LENGTH                           0x1
#define _CLC7GLS3_LC7G4D1T_MASK                             0x2
#define _CLC7GLS3_LC7G4D2N_POSN                             0x2
#define _CLC7GLS3_LC7G4D2N_POSITION                         0x2
#define _CLC7GLS3_LC7G4D2N_SIZE                             0x1
#define _CLC7GLS3_LC7G4D2N_LENGTH                           0x1
#define _CLC7GLS3_LC7G4D2N_MASK                             0x4
#define _CLC7GLS3_LC7G4D2T_POSN                             0x3
#define _CLC7GLS3_LC7G4D2T_POSITION                         0x3
#define _CLC7GLS3_LC7G4D2T_SIZE                             0x1
#define _CLC7GLS3_LC7G4D2T_LENGTH                           0x1
#define _CLC7GLS3_LC7G4D2T_MASK                             0x8
#define _CLC7GLS3_LC7G4D3N_POSN                             0x4
#define _CLC7GLS3_LC7G4D3N_POSITION                         0x4
#define _CLC7GLS3_LC7G4D3N_SIZE                             0x1
#define _CLC7GLS3_LC7G4D3N_LENGTH                           0x1
#define _CLC7GLS3_LC7G4D3N_MASK                             0x10
#define _CLC7GLS3_LC7G4D3T_POSN                             0x5
#define _CLC7GLS3_LC7G4D3T_POSITION                         0x5
#define _CLC7GLS3_LC7G4D3T_SIZE                             0x1
#define _CLC7GLS3_LC7G4D3T_LENGTH                           0x1
#define _CLC7GLS3_LC7G4D3T_MASK                             0x20
#define _CLC7GLS3_LC7G4D4N_POSN                             0x6
#define _CLC7GLS3_LC7G4D4N_POSITION                         0x6
#define _CLC7GLS3_LC7G4D4N_SIZE                             0x1
#define _CLC7GLS3_LC7G4D4N_LENGTH                           0x1
#define _CLC7GLS3_LC7G4D4N_MASK                             0x40
#define _CLC7GLS3_LC7G4D4T_POSN                             0x7
#define _CLC7GLS3_LC7G4D4T_POSITION                         0x7
#define _CLC7GLS3_LC7G4D4T_SIZE                             0x1
#define _CLC7GLS3_LC7G4D4T_LENGTH                           0x1
#define _CLC7GLS3_LC7G4D4T_MASK                             0x80

// Register: CLC8CON
#define CLC8CON CLC8CON
extern volatile unsigned char           CLC8CON             __at(0xE6D);
#ifndef _LIB_BUILD
asm("CLC8CON equ 0E6Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned LC8MODE                :3;
        unsigned LC8INTN                :1;
        unsigned LC8INTP                :1;
        unsigned LC8OUT                 :1;
        unsigned                        :1;
        unsigned LC8EN                  :1;
    };
    struct {
        unsigned LC8MODE0               :1;
        unsigned LC8MODE1               :1;
        unsigned LC8MODE2               :1;
    };
} CLC8CONbits_t;
extern volatile CLC8CONbits_t CLC8CONbits __at(0xE6D);
// bitfield macros
#define _CLC8CON_MODE_POSN                                  0x0
#define _CLC8CON_MODE_POSITION                              0x0
#define _CLC8CON_MODE_SIZE                                  0x3
#define _CLC8CON_MODE_LENGTH                                0x3
#define _CLC8CON_MODE_MASK                                  0x7
#define _CLC8CON_INTN_POSN                                  0x3
#define _CLC8CON_INTN_POSITION                              0x3
#define _CLC8CON_INTN_SIZE                                  0x1
#define _CLC8CON_INTN_LENGTH                                0x1
#define _CLC8CON_INTN_MASK                                  0x8
#define _CLC8CON_INTP_POSN                                  0x4
#define _CLC8CON_INTP_POSITION                              0x4
#define _CLC8CON_INTP_SIZE                                  0x1
#define _CLC8CON_INTP_LENGTH                                0x1
#define _CLC8CON_INTP_MASK                                  0x10
#define _CLC8CON_OUT_POSN                                   0x5
#define _CLC8CON_OUT_POSITION                               0x5
#define _CLC8CON_OUT_SIZE                                   0x1
#define _CLC8CON_OUT_LENGTH                                 0x1
#define _CLC8CON_OUT_MASK                                   0x20
#define _CLC8CON_EN_POSN                                    0x7
#define _CLC8CON_EN_POSITION                                0x7
#define _CLC8CON_EN_SIZE                                    0x1
#define _CLC8CON_EN_LENGTH                                  0x1
#define _CLC8CON_EN_MASK                                    0x80
#define _CLC8CON_MODE0_POSN                                 0x0
#define _CLC8CON_MODE0_POSITION                             0x0
#define _CLC8CON_MODE0_SIZE                                 0x1
#define _CLC8CON_MODE0_LENGTH                               0x1
#define _CLC8CON_MODE0_MASK                                 0x1
#define _CLC8CON_MODE1_POSN                                 0x1
#define _CLC8CON_MODE1_POSITION                             0x1
#define _CLC8CON_MODE1_SIZE                                 0x1
#define _CLC8CON_MODE1_LENGTH                               0x1
#define _CLC8CON_MODE1_MASK                                 0x2
#define _CLC8CON_MODE2_POSN                                 0x2
#define _CLC8CON_MODE2_POSITION                             0x2
#define _CLC8CON_MODE2_SIZE                                 0x1
#define _CLC8CON_MODE2_LENGTH                               0x1
#define _CLC8CON_MODE2_MASK                                 0x4
#define _CLC8CON_LC8MODE_POSN                               0x0
#define _CLC8CON_LC8MODE_POSITION                           0x0
#define _CLC8CON_LC8MODE_SIZE                               0x3
#define _CLC8CON_LC8MODE_LENGTH                             0x3
#define _CLC8CON_LC8MODE_MASK                               0x7
#define _CLC8CON_LC8INTN_POSN                               0x3
#define _CLC8CON_LC8INTN_POSITION                           0x3
#define _CLC8CON_LC8INTN_SIZE                               0x1
#define _CLC8CON_LC8INTN_LENGTH                             0x1
#define _CLC8CON_LC8INTN_MASK                               0x8
#define _CLC8CON_LC8INTP_POSN                               0x4
#define _CLC8CON_LC8INTP_POSITION                           0x4
#define _CLC8CON_LC8INTP_SIZE                               0x1
#define _CLC8CON_LC8INTP_LENGTH                             0x1
#define _CLC8CON_LC8INTP_MASK                               0x10
#define _CLC8CON_LC8OUT_POSN                                0x5
#define _CLC8CON_LC8OUT_POSITION                            0x5
#define _CLC8CON_LC8OUT_SIZE                                0x1
#define _CLC8CON_LC8OUT_LENGTH                              0x1
#define _CLC8CON_LC8OUT_MASK                                0x20
#define _CLC8CON_LC8EN_POSN                                 0x7
#define _CLC8CON_LC8EN_POSITION                             0x7
#define _CLC8CON_LC8EN_SIZE                                 0x1
#define _CLC8CON_LC8EN_LENGTH                               0x1
#define _CLC8CON_LC8EN_MASK                                 0x80
#define _CLC8CON_LC8MODE0_POSN                              0x0
#define _CLC8CON_LC8MODE0_POSITION                          0x0
#define _CLC8CON_LC8MODE0_SIZE                              0x1
#define _CLC8CON_LC8MODE0_LENGTH                            0x1
#define _CLC8CON_LC8MODE0_MASK                              0x1
#define _CLC8CON_LC8MODE1_POSN                              0x1
#define _CLC8CON_LC8MODE1_POSITION                          0x1
#define _CLC8CON_LC8MODE1_SIZE                              0x1
#define _CLC8CON_LC8MODE1_LENGTH                            0x1
#define _CLC8CON_LC8MODE1_MASK                              0x2
#define _CLC8CON_LC8MODE2_POSN                              0x2
#define _CLC8CON_LC8MODE2_POSITION                          0x2
#define _CLC8CON_LC8MODE2_SIZE                              0x1
#define _CLC8CON_LC8MODE2_LENGTH                            0x1
#define _CLC8CON_LC8MODE2_MASK                              0x4

// Register: CLC8POL
#define CLC8POL CLC8POL
extern volatile unsigned char           CLC8POL             __at(0xE6E);
#ifndef _LIB_BUILD
asm("CLC8POL equ 0E6Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1POL                  :1;
        unsigned G2POL                  :1;
        unsigned G3POL                  :1;
        unsigned G4POL                  :1;
        unsigned                        :3;
        unsigned POL                    :1;
    };
    struct {
        unsigned LC8G1POL               :1;
        unsigned LC8G2POL               :1;
        unsigned LC8G3POL               :1;
        unsigned LC8G4POL               :1;
        unsigned                        :3;
        unsigned LC8POL                 :1;
    };
} CLC8POLbits_t;
extern volatile CLC8POLbits_t CLC8POLbits __at(0xE6E);
// bitfield macros
#define _CLC8POL_G1POL_POSN                                 0x0
#define _CLC8POL_G1POL_POSITION                             0x0
#define _CLC8POL_G1POL_SIZE                                 0x1
#define _CLC8POL_G1POL_LENGTH                               0x1
#define _CLC8POL_G1POL_MASK                                 0x1
#define _CLC8POL_G2POL_POSN                                 0x1
#define _CLC8POL_G2POL_POSITION                             0x1
#define _CLC8POL_G2POL_SIZE                                 0x1
#define _CLC8POL_G2POL_LENGTH                               0x1
#define _CLC8POL_G2POL_MASK                                 0x2
#define _CLC8POL_G3POL_POSN                                 0x2
#define _CLC8POL_G3POL_POSITION                             0x2
#define _CLC8POL_G3POL_SIZE                                 0x1
#define _CLC8POL_G3POL_LENGTH                               0x1
#define _CLC8POL_G3POL_MASK                                 0x4
#define _CLC8POL_G4POL_POSN                                 0x3
#define _CLC8POL_G4POL_POSITION                             0x3
#define _CLC8POL_G4POL_SIZE                                 0x1
#define _CLC8POL_G4POL_LENGTH                               0x1
#define _CLC8POL_G4POL_MASK                                 0x8
#define _CLC8POL_POL_POSN                                   0x7
#define _CLC8POL_POL_POSITION                               0x7
#define _CLC8POL_POL_SIZE                                   0x1
#define _CLC8POL_POL_LENGTH                                 0x1
#define _CLC8POL_POL_MASK                                   0x80
#define _CLC8POL_LC8G1POL_POSN                              0x0
#define _CLC8POL_LC8G1POL_POSITION                          0x0
#define _CLC8POL_LC8G1POL_SIZE                              0x1
#define _CLC8POL_LC8G1POL_LENGTH                            0x1
#define _CLC8POL_LC8G1POL_MASK                              0x1
#define _CLC8POL_LC8G2POL_POSN                              0x1
#define _CLC8POL_LC8G2POL_POSITION                          0x1
#define _CLC8POL_LC8G2POL_SIZE                              0x1
#define _CLC8POL_LC8G2POL_LENGTH                            0x1
#define _CLC8POL_LC8G2POL_MASK                              0x2
#define _CLC8POL_LC8G3POL_POSN                              0x2
#define _CLC8POL_LC8G3POL_POSITION                          0x2
#define _CLC8POL_LC8G3POL_SIZE                              0x1
#define _CLC8POL_LC8G3POL_LENGTH                            0x1
#define _CLC8POL_LC8G3POL_MASK                              0x4
#define _CLC8POL_LC8G4POL_POSN                              0x3
#define _CLC8POL_LC8G4POL_POSITION                          0x3
#define _CLC8POL_LC8G4POL_SIZE                              0x1
#define _CLC8POL_LC8G4POL_LENGTH                            0x1
#define _CLC8POL_LC8G4POL_MASK                              0x8
#define _CLC8POL_LC8POL_POSN                                0x7
#define _CLC8POL_LC8POL_POSITION                            0x7
#define _CLC8POL_LC8POL_SIZE                                0x1
#define _CLC8POL_LC8POL_LENGTH                              0x1
#define _CLC8POL_LC8POL_MASK                                0x80

