MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
extern volatile MDCARHbits_t MDCARHbits __at(0xF50);
// bitfield macros
#define _MDCARH_CHS_POSN                                    0x0
#define _MDCARH_CHS_POSITION                                0x0
#define _MDCARH_CHS_SIZE                                    0x3
#define _MDCARH_CHS_LENGTH                                  0x3
#define _MDCARH_CHS_MASK                                    0x7
#define _MDCARH_CHS0_POSN                                   0x0
#define _MDCARH_CHS0_POSITION                               0x0
#define _MDCARH_CHS0_SIZE                                   0x1
#define _MDCARH_CHS0_LENGTH                                 0x1
#define _MDCARH_CHS0_MASK                                   0x1
#define _MDCARH_CHS1_POSN                                   0x1
#define _MDCARH_CHS1_POSITION                               0x1
#define _MDCARH_CHS1_SIZE                                   0x1
#define _MDCARH_CHS1_LENGTH                                 0x1
#define _MDCARH_CHS1_MASK                                   0x2
#define _MDCARH_CHS2_POSN                                   0x2
#define _MDCARH_CHS2_POSITION                               0x2
#define _MDCARH_CHS2_SIZE                                   0x1
#define _MDCARH_CHS2_LENGTH                                 0x1
#define _MDCARH_CHS2_MASK                                   0x4
#define _MDCARH_MDCHS_POSN                                  0x0
#define _MDCARH_MDCHS_POSITION                              0x0
#define _MDCARH_MDCHS_SIZE                                  0x3
#define _MDCARH_MDCHS_LENGTH                                0x3
#define _MDCARH_MDCHS_MASK                                  0x7
#define _MDCARH_MDCHS0_POSN                                 0x0
#define _MDCARH_MDCHS0_POSITION                             0x0
#define _MDCARH_MDCHS0_SIZE                                 0x1
#define _MDCARH_MDCHS0_LENGTH                               0x1
#define _MDCARH_MDCHS0_MASK                                 0x1
#define _MDCARH_MDCHS1_POSN                                 0x1
#define _MDCARH_MDCHS1_POSITION                             0x1
#define _MDCARH_MDCHS1_SIZE                                 0x1
#define _MDCARH_MDCHS1_LENGTH                               0x1
#define _MDCARH_MDCHS1_MASK                                 0x2
#define _MDCARH_MDCHS2_POSN                                 0x2
#define _MDCARH_MDCHS2_POSITION                             0x2
#define _MDCARH_MDCHS2_SIZE                                 0x1
#define _MDCARH_MDCHS2_LENGTH                               0x1
#define _MDCARH_MDCHS2_MASK                                 0x4

// Register: ADACT
#define ADACT ADACT
extern volatile unsigned char           ADACT               __at(0xF51);
#ifndef _LIB_BUILD
asm("ADACT equ 0F51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACT                  :5;
    };
    struct {
        unsigned ADACT0                 :1;
        unsigned ADACT1                 :1;
        unsigned ADACT2                 :1;
        unsigned ADACT3                 :1;
        unsigned ADACT4                 :1;
    };
} ADACTbits_t;
extern volatile ADACTbits_t ADACTbits __at(0xF51);
// bitfield macros
#define _ADACT_ADACT_POSN                                   0x0
#define _ADACT_ADACT_POSITION                               0x0
#define _ADACT_ADACT_SIZE                                   0x5
#define _ADACT_ADACT_LENGTH                                 0x5
#define _ADACT_ADACT_MASK                                   0x1F
#define _ADACT_ADACT0_POSN                                  0x0
#define _ADACT_ADACT0_POSITION                              0x0
#define _ADACT_ADACT0_SIZE                                  0x1
#define _ADACT_ADACT0_LENGTH                                0x1
#define _ADACT_ADACT0_MASK                                  0x1
#define _ADACT_ADACT1_POSN                                  0x1
#define _ADACT_ADACT1_POSITION                              0x1
#define _ADACT_ADACT1_SIZE                                  0x1
#define _ADACT_ADACT1_LENGTH                                0x1
#define _ADACT_ADACT1_MASK                                  0x2
#define _ADACT_ADACT2_POSN                                  0x2
#define _ADACT_ADACT2_POSITION                              0x2
#define _ADACT_ADACT2_SIZE                                  0x1
#define _ADACT_ADACT2_LENGTH                                0x1
#define _ADACT_ADACT2_MASK                                  0x4
#define _ADACT_ADACT3_POSN                                  0x3
#define _ADACT_ADACT3_POSITION                              0x3
#define _ADACT_ADACT3_SIZE                                  0x1
#define _ADACT_ADACT3_LENGTH                                0x1
#define _ADACT_ADACT3_MASK                                  0x8
#define _ADACT_ADACT4_POSN                                  0x4
#define _ADACT_ADACT4_POSITION                              0x4
#define _ADACT_ADACT4_SIZE                                  0x1
#define _ADACT_ADACT4_LENGTH                                0x1
#define _ADACT_ADACT4_MASK                                  0x10

// Register: ADCLK
#define ADCLK ADCLK
extern volatile unsigned char           ADCLK               __at(0xF52);
#ifndef _LIB_BUILD
asm("ADCLK equ 0F52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCS                   :6;
    };
    struct {
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
        unsigned ADCS3                  :1;
        unsigned ADCS4                  :1;
        unsigned ADCS5                  :1;
    };
} ADCLKbits_t;
extern volatile ADCLKbits_t ADCLKbits __at(0xF52);
// bitfield macros
#define _ADCLK_ADCS_POSN                                    0x0
#define _ADCLK_ADCS_POSITION                                0x0
#define _ADCLK_ADCS_SIZE                                    0x6
#define _ADCLK_ADCS_LENGTH                                  0x6
#define _ADCLK_ADCS_MASK                                    0x3F
#define _ADCLK_ADCS0_POSN                                   0x0
#define _ADCLK_ADCS0_POSITION                               0x0
#define _ADCLK_ADCS0_SIZE                                   0x1
#define _ADCLK_ADCS0_LENGTH                                 0x1
#define _ADCLK_ADCS0_MASK                                   0x1
#define _ADCLK_ADCS1_POSN                                   0x1
#define _ADCLK_ADCS1_POSITION                               0x1
#define _ADCLK_ADCS1_SIZE                                   0x1
#define _ADCLK_ADCS1_LENGTH                                 0x1
#define _ADCLK_ADCS1_MASK                                   0x2
#define _ADCLK_ADCS2_POSN                                   0x2
#define _ADCLK_ADCS2_POSITION                               0x2
#define _ADCLK_ADCS2_SIZE                                   0x1
#define _ADCLK_ADCS2_LENGTH                                 0x1
#define _ADCLK_ADCS2_MASK                                   0x4
#define _ADCLK_ADCS3_POSN                                   0x3
#define _ADCLK_ADCS3_POSITION                               0x3
#define _ADCLK_ADCS3_SIZE                                   0x1
#define _ADCLK_ADCS3_LENGTH                                 0x1
#define _ADCLK_ADCS3_MASK                                   0x8
#define _ADCLK_ADCS4_POSN                                   0x4
#define _ADCLK_ADCS4_POSITION                               0x4
#define _ADCLK_ADCS4_SIZE                                   0x1
#define _ADCLK_ADCS4_LENGTH                                 0x1
#define _ADCLK_ADCS4_MASK                                   0x10
#define _ADCLK_ADCS5_POSN                                   0x5
#define _ADCLK_ADCS5_POSITION                               0x5
#define _ADCLK_ADCS5_SIZE                                   0x1
#define _ADCLK_ADCS5_LENGTH                                 0x1
#define _ADCLK_ADCS5_MASK                                   0x20

// Register: ADREF
#define ADREF ADREF
extern volatile unsigned char           ADREF               __at(0xF53);
#ifndef _LIB_BUILD
asm("ADREF equ 0F53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADPREF                 :2;
        unsigned                        :2;
        unsigned ADNREF                 :1;
    };
    struct {
        unsigned ADPREF0                :1;
        unsigned ADPREF1                :1;
    };
} ADREFbits_t;
