MikroElektronika/core_packages/PIC/XC8/def/PIC18F26Q10/mcu.h
#define                                 LC8G1D1T_bit        _BIT_ACCESS(CLC8GLS0,1)
// CLC8GLS0<LC8G1D2N>
extern volatile __bit                   LC8G1D2N            __at(0x739A);	// @ (0xE73 * 8 + 2)
#define                                 LC8G1D2N_bit        _BIT_ACCESS(CLC8GLS0,2)
// CLC8GLS0<LC8G1D2T>
extern volatile __bit                   LC8G1D2T            __at(0x739B);	// @ (0xE73 * 8 + 3)
#define                                 LC8G1D2T_bit        _BIT_ACCESS(CLC8GLS0,3)
// CLC8GLS0<LC8G1D3N>
extern volatile __bit                   LC8G1D3N            __at(0x739C);	// @ (0xE73 * 8 + 4)
#define                                 LC8G1D3N_bit        _BIT_ACCESS(CLC8GLS0,4)
// CLC8GLS0<LC8G1D3T>
extern volatile __bit                   LC8G1D3T            __at(0x739D);	// @ (0xE73 * 8 + 5)
#define                                 LC8G1D3T_bit        _BIT_ACCESS(CLC8GLS0,5)
// CLC8GLS0<LC8G1D4N>
extern volatile __bit                   LC8G1D4N            __at(0x739E);	// @ (0xE73 * 8 + 6)
#define                                 LC8G1D4N_bit        _BIT_ACCESS(CLC8GLS0,6)
// CLC8GLS0<LC8G1D4T>
extern volatile __bit                   LC8G1D4T            __at(0x739F);	// @ (0xE73 * 8 + 7)
#define                                 LC8G1D4T_bit        _BIT_ACCESS(CLC8GLS0,7)
// CLC8POL<LC8G1POL>
extern volatile __bit                   LC8G1POL            __at(0x7370);	// @ (0xE6E * 8 + 0)
#define                                 LC8G1POL_bit        _BIT_ACCESS(CLC8POL,0)
// CLC8GLS1<LC8G2D1N>
extern volatile __bit                   LC8G2D1N            __at(0x73A0);	// @ (0xE74 * 8 + 0)
#define                                 LC8G2D1N_bit        _BIT_ACCESS(CLC8GLS1,0)
// CLC8GLS1<LC8G2D1T>
extern volatile __bit                   LC8G2D1T            __at(0x73A1);	// @ (0xE74 * 8 + 1)
#define                                 LC8G2D1T_bit        _BIT_ACCESS(CLC8GLS1,1)
// CLC8GLS1<LC8G2D2N>
extern volatile __bit                   LC8G2D2N            __at(0x73A2);	// @ (0xE74 * 8 + 2)
#define                                 LC8G2D2N_bit        _BIT_ACCESS(CLC8GLS1,2)
// CLC8GLS1<LC8G2D2T>
extern volatile __bit                   LC8G2D2T            __at(0x73A3);	// @ (0xE74 * 8 + 3)
#define                                 LC8G2D2T_bit        _BIT_ACCESS(CLC8GLS1,3)
// CLC8GLS1<LC8G2D3N>
extern volatile __bit                   LC8G2D3N            __at(0x73A4);	// @ (0xE74 * 8 + 4)
#define                                 LC8G2D3N_bit        _BIT_ACCESS(CLC8GLS1,4)
// CLC8GLS1<LC8G2D3T>
extern volatile __bit                   LC8G2D3T            __at(0x73A5);	// @ (0xE74 * 8 + 5)
#define                                 LC8G2D3T_bit        _BIT_ACCESS(CLC8GLS1,5)
// CLC8GLS1<LC8G2D4N>
extern volatile __bit                   LC8G2D4N            __at(0x73A6);	// @ (0xE74 * 8 + 6)
#define                                 LC8G2D4N_bit        _BIT_ACCESS(CLC8GLS1,6)
// CLC8GLS1<LC8G2D4T>
extern volatile __bit                   LC8G2D4T            __at(0x73A7);	// @ (0xE74 * 8 + 7)
#define                                 LC8G2D4T_bit        _BIT_ACCESS(CLC8GLS1,7)
// CLC8POL<LC8G2POL>
extern volatile __bit                   LC8G2POL            __at(0x7371);	// @ (0xE6E * 8 + 1)
#define                                 LC8G2POL_bit        _BIT_ACCESS(CLC8POL,1)
// CLC8GLS2<LC8G3D1N>
extern volatile __bit                   LC8G3D1N            __at(0x73A8);	// @ (0xE75 * 8 + 0)
#define                                 LC8G3D1N_bit        _BIT_ACCESS(CLC8GLS2,0)
// CLC8GLS2<LC8G3D1T>
extern volatile __bit                   LC8G3D1T            __at(0x73A9);	// @ (0xE75 * 8 + 1)
#define                                 LC8G3D1T_bit        _BIT_ACCESS(CLC8GLS2,1)
// CLC8GLS2<LC8G3D2N>
extern volatile __bit                   LC8G3D2N            __at(0x73AA);	// @ (0xE75 * 8 + 2)
#define                                 LC8G3D2N_bit        _BIT_ACCESS(CLC8GLS2,2)
// CLC8GLS2<LC8G3D2T>
extern volatile __bit                   LC8G3D2T            __at(0x73AB);	// @ (0xE75 * 8 + 3)
#define                                 LC8G3D2T_bit        _BIT_ACCESS(CLC8GLS2,3)
// CLC8GLS2<LC8G3D3N>
extern volatile __bit                   LC8G3D3N            __at(0x73AC);	// @ (0xE75 * 8 + 4)
#define                                 LC8G3D3N_bit        _BIT_ACCESS(CLC8GLS2,4)
// CLC8GLS2<LC8G3D3T>
extern volatile __bit                   LC8G3D3T            __at(0x73AD);	// @ (0xE75 * 8 + 5)
#define                                 LC8G3D3T_bit        _BIT_ACCESS(CLC8GLS2,5)
// CLC8GLS2<LC8G3D4N>
extern volatile __bit                   LC8G3D4N            __at(0x73AE);	// @ (0xE75 * 8 + 6)
#define                                 LC8G3D4N_bit        _BIT_ACCESS(CLC8GLS2,6)
// CLC8GLS2<LC8G3D4T>
extern volatile __bit                   LC8G3D4T            __at(0x73AF);	// @ (0xE75 * 8 + 7)
#define                                 LC8G3D4T_bit        _BIT_ACCESS(CLC8GLS2,7)
// CLC8POL<LC8G3POL>
extern volatile __bit                   LC8G3POL            __at(0x7372);	// @ (0xE6E * 8 + 2)
#define                                 LC8G3POL_bit        _BIT_ACCESS(CLC8POL,2)
// CLC8GLS3<LC8G4D1N>
extern volatile __bit                   LC8G4D1N            __at(0x73B0);	// @ (0xE76 * 8 + 0)
#define                                 LC8G4D1N_bit        _BIT_ACCESS(CLC8GLS3,0)
// CLC8GLS3<LC8G4D1T>
extern volatile __bit                   LC8G4D1T            __at(0x73B1);	// @ (0xE76 * 8 + 1)
#define                                 LC8G4D1T_bit        _BIT_ACCESS(CLC8GLS3,1)
// CLC8GLS3<LC8G4D2N>
extern volatile __bit                   LC8G4D2N            __at(0x73B2);	// @ (0xE76 * 8 + 2)
#define                                 LC8G4D2N_bit        _BIT_ACCESS(CLC8GLS3,2)
// CLC8GLS3<LC8G4D2T>
extern volatile __bit                   LC8G4D2T            __at(0x73B3);	// @ (0xE76 * 8 + 3)
#define                                 LC8G4D2T_bit        _BIT_ACCESS(CLC8GLS3,3)
// CLC8GLS3<LC8G4D3N>
extern volatile __bit                   LC8G4D3N            __at(0x73B4);	// @ (0xE76 * 8 + 4)
#define                                 LC8G4D3N_bit        _BIT_ACCESS(CLC8GLS3,4)
// CLC8GLS3<LC8G4D3T>
extern volatile __bit                   LC8G4D3T            __at(0x73B5);	// @ (0xE76 * 8 + 5)
#define                                 LC8G4D3T_bit        _BIT_ACCESS(CLC8GLS3,5)
// CLC8GLS3<LC8G4D4N>
extern volatile __bit                   LC8G4D4N            __at(0x73B6);	// @ (0xE76 * 8 + 6)
#define                                 LC8G4D4N_bit        _BIT_ACCESS(CLC8GLS3,6)
// CLC8GLS3<LC8G4D4T>
extern volatile __bit                   LC8G4D4T            __at(0x73B7);	// @ (0xE76 * 8 + 7)
#define                                 LC8G4D4T_bit        _BIT_ACCESS(CLC8GLS3,7)
// CLC8POL<LC8G4POL>
extern volatile __bit                   LC8G4POL            __at(0x7373);	// @ (0xE6E * 8 + 3)
#define                                 LC8G4POL_bit        _BIT_ACCESS(CLC8POL,3)
// CLC8CON<LC8INTN>
extern volatile __bit                   LC8INTN             __at(0x736B);	// @ (0xE6D * 8 + 3)
#define                                 LC8INTN_bit         _BIT_ACCESS(CLC8CON,3)
// CLC8CON<LC8INTP>
extern volatile __bit                   LC8INTP             __at(0x736C);	// @ (0xE6D * 8 + 4)
#define                                 LC8INTP_bit         _BIT_ACCESS(CLC8CON,4)
// CLC8CON<LC8MODE0>
extern volatile __bit                   LC8MODE0            __at(0x7368);	// @ (0xE6D * 8 + 0)
#define                                 LC8MODE0_bit        _BIT_ACCESS(CLC8CON,0)
// CLC8CON<LC8MODE1>
extern volatile __bit                   LC8MODE1            __at(0x7369);	// @ (0xE6D * 8 + 1)
#define                                 LC8MODE1_bit        _BIT_ACCESS(CLC8CON,1)
// CLC8CON<LC8MODE2>
extern volatile __bit                   LC8MODE2            __at(0x736A);	// @ (0xE6D * 8 + 2)
#define                                 LC8MODE2_bit        _BIT_ACCESS(CLC8CON,2)
// CLC8CON<LC8OUT>
extern volatile __bit                   LC8OUT              __at(0x736D);	// @ (0xE6D * 8 + 5)
#define                                 LC8OUT_bit          _BIT_ACCESS(CLC8CON,5)
// CLC8POL<LC8POL>
extern volatile __bit                   LC8POL              __at(0x7377);	// @ (0xE6E * 8 + 7)
#define                                 LC8POL_bit          _BIT_ACCESS(CLC8POL,7)
// CWG1CON0<LD>
extern volatile __bit                   LD                  __at(0x79FE);	// @ (0xF3F * 8 + 6)
#define                                 LD_bit              _BIT_ACCESS(CWG1CON0,6)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x76BC);	// @ (0xED7 * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x76B4);	// @ (0xED6 * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT,4)
// CWG1AS0<LSAC0>
extern volatile __bit                   LSAC0               __at(0x7A0A);	// @ (0xF41 * 8 + 2)
#define                                 LSAC0_bit           _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<LSAC1>
extern volatile __bit                   LSAC1               __at(0x7A0B);	// @ (0xF41 * 8 + 3)
#define                                 LSAC1_bit           _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<LSBD0>
extern volatile __bit                   LSBD0               __at(0x7A0C);	// @ (0xF41 * 8 + 4)
#define                                 LSBD0_bit           _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<LSBD1>
extern volatile __bit                   LSBD1               __at(0x7A0D);	// @ (0xF41 * 8 + 5)
#define                                 LSBD1_bit           _BIT_ACCESS(CWG1AS0,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x79C0);	// @ (0xF38 * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x79C1);	// @ (0xF38 * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// CLCDATA<MCL1OUT>
extern volatile __bit                   MCL1OUT             __at(0x73B8);	// @ (0xE77 * 8 + 0)
#define                                 MCL1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// MDCON0<MDBIT>
extern volatile __bit                   MDBIT               __at(0x7A60);	// @ (0xF4C * 8 + 0)
#define                                 MDBIT_bit           _BIT_ACCESS(MDCON0,0)
// MDCARHPPS<MDCARHPPS0>
extern volatile __bit                   MDCARHPPS0          __at(0x7570);	// @ (0xEAE * 8 + 0)
#define                                 MDCARHPPS0_bit      _BIT_ACCESS(MDCARHPPS,0)
// MDCARHPPS<MDCARHPPS1>
extern volatile __bit                   MDCARHPPS1          __at(0x7571);	// @ (0xEAE * 8 + 1)
#define                                 MDCARHPPS1_bit      _BIT_ACCESS(MDCARHPPS,1)
// MDCARHPPS<MDCARHPPS2>
extern volatile __bit                   MDCARHPPS2          __at(0x7572);	// @ (0xEAE * 8 + 2)
#define                                 MDCARHPPS2_bit      _BIT_ACCESS(MDCARHPPS,2)
// MDCARHPPS<MDCARHPPS3>
extern volatile __bit                   MDCARHPPS3          __at(0x7573);	// @ (0xEAE * 8 + 3)
#define                                 MDCARHPPS3_bit      _BIT_ACCESS(MDCARHPPS,3)
// MDCARHPPS<MDCARHPPS4>
extern volatile __bit                   MDCARHPPS4          __at(0x7574);	// @ (0xEAE * 8 + 4)
#define                                 MDCARHPPS4_bit      _BIT_ACCESS(MDCARHPPS,4)
// MDCARLPPS<MDCARLPPS0>
extern volatile __bit                   MDCARLPPS0          __at(0x7568);	// @ (0xEAD * 8 + 0)
#define                                 MDCARLPPS0_bit      _BIT_ACCESS(MDCARLPPS,0)
// MDCARLPPS<MDCARLPPS1>
extern volatile __bit                   MDCARLPPS1          __at(0x7569);	// @ (0xEAD * 8 + 1)
#define                                 MDCARLPPS1_bit      _BIT_ACCESS(MDCARLPPS,1)
// MDCARLPPS<MDCARLPPS2>
extern volatile __bit                   MDCARLPPS2          __at(0x756A);	// @ (0xEAD * 8 + 2)
#define                                 MDCARLPPS2_bit      _BIT_ACCESS(MDCARLPPS,2)
// MDCARLPPS<MDCARLPPS3>
extern volatile __bit                   MDCARLPPS3          __at(0x756B);	// @ (0xEAD * 8 + 3)
#define                                 MDCARLPPS3_bit      _BIT_ACCESS(MDCARLPPS,3)
// MDCARLPPS<MDCARLPPS4>
extern volatile __bit                   MDCARLPPS4          __at(0x756C);	// @ (0xEAD * 8 + 4)
#define                                 MDCARLPPS4_bit      _BIT_ACCESS(MDCARLPPS,4)
// MDCON1<MDCHPOL>
extern volatile __bit                   MDCHPOL             __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 MDCHPOL_bit         _BIT_ACCESS(MDCON1,5)
// MDCARH<MDCHS0>
extern volatile __bit                   MDCHS0              __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 MDCHS0_bit          _BIT_ACCESS(MDCARH,0)
// MDCARH<MDCHS1>
extern volatile __bit                   MDCHS1              __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 MDCHS1_bit          _BIT_ACCESS(MDCARH,1)
// MDCARH<MDCHS2>
extern volatile __bit                   MDCHS2              __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 MDCHS2_bit          _BIT_ACCESS(MDCARH,2)
// MDCON1<MDCHSYNC>
extern volatile __bit                   MDCHSYNC            __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 MDCHSYNC_bit        _BIT_ACCESS(MDCON1,4)
// MDCON1<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x7A69);	// @ (0xF4D * 8 + 1)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCON1,1)
// MDCARL<MDCLS0>
extern volatile __bit                   MDCLS0              __at(0x7A78);	// @ (0xF4F * 8 + 0)
#define                                 MDCLS0_bit          _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCLS1>
extern volatile __bit                   MDCLS1              __at(0x7A79);	// @ (0xF4F * 8 + 1)
#define                                 MDCLS1_bit          _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCLS2>
extern volatile __bit                   MDCLS2              __at(0x7A7A);	// @ (0xF4F * 8 + 2)
#define                                 MDCLS2_bit          _BIT_ACCESS(MDCARL,2)
// MDCON1<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x7A68);	// @ (0xF4D * 8 + 0)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCON1,0)
// MDCON0<MDEN>
extern volatile __bit                   MDEN                __at(0x7A67);	// @ (0xF4C * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON0,7)
// MDCON0<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x7A64);	// @ (0xF4C * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON0,4)
// MDCON0<MDOUT>
extern volatile __bit                   MDOUT               __at(0x7A65);	// @ (0xF4C * 8 + 5)
#define                                 MDOUT_bit           _BIT_ACCESS(MDCON0,5)
// MDSRCPPS<MDSRCPPS0>
extern volatile __bit                   MDSRCPPS0           __at(0x7578);	// @ (0xEAF * 8 + 0)
#define                                 MDSRCPPS0_bit       _BIT_ACCESS(MDSRCPPS,0)
// MDSRCPPS<MDSRCPPS1>
extern volatile __bit                   MDSRCPPS1           __at(0x7579);	// @ (0xEAF * 8 + 1)
#define                                 MDSRCPPS1_bit       _BIT_ACCESS(MDSRCPPS,1)
// MDSRCPPS<MDSRCPPS2>
extern volatile __bit                   MDSRCPPS2           __at(0x757A);	// @ (0xEAF * 8 + 2)
#define                                 MDSRCPPS2_bit       _BIT_ACCESS(MDSRCPPS,2)
// MDSRCPPS<MDSRCPPS3>
extern volatile __bit                   MDSRCPPS3           __at(0x757B);	// @ (0xEAF * 8 + 3)
#define                                 MDSRCPPS3_bit       _BIT_ACCESS(MDSRCPPS,3)
// MDSRCPPS<MDSRCPPS4>
extern volatile __bit                   MDSRCPPS4           __at(0x757C);	// @ (0xEAF * 8 + 4)
#define                                 MDSRCPPS4_bit       _BIT_ACCESS(MDSRCPPS,4)
// MDSRC<MDSRCS0>
extern volatile __bit                   MDSRCS0             __at(0x7A70);	// @ (0xF4E * 8 + 0)
#define                                 MDSRCS0_bit         _BIT_ACCESS(MDSRC,0)
// MDSRC<MDSRCS1>
extern volatile __bit                   MDSRCS1             __at(0x7A71);	// @ (0xF4E * 8 + 1)
#define                                 MDSRCS1_bit         _BIT_ACCESS(MDSRC,1)
// MDSRC<MDSRCS2>
extern volatile __bit                   MDSRCS2             __at(0x7A72);	// @ (0xF4E * 8 + 2)
#define                                 MDSRCS2_bit         _BIT_ACCESS(MDSRC,2)
// MDSRC<MDSRCS3>
extern volatile __bit                   MDSRCS3             __at(0x7A73);	// @ (0xF4E * 8 + 3)
#define                                 MDSRCS3_bit         _BIT_ACCESS(MDSRC,3)
// OSCEN<MFOEN>
extern volatile __bit                   MFOEN               __at(0x76BD);	// @ (0xED7 * 8 + 5)
#define                                 MFOEN_bit           _BIT_ACCESS(OSCEN,5)
// OSCSTAT<MFOR>
extern volatile __bit                   MFOR                __at(0x76B5);	// @ (0xED6 * 8 + 5)
#define                                 MFOR_bit            _BIT_ACCESS(OSCSTAT,5)
// CLCDATA<MLC2OUT>
extern volatile __bit                   MLC2OUT             __at(0x73B9);	// @ (0xE77 * 8 + 1)
#define                                 MLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// CLCDATA<MLC3OUT>
extern volatile __bit                   MLC3OUT             __at(0x73BA);	// @ (0xE77 * 8 + 2)
#define                                 MLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0x73BB);	// @ (0xE77 * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// CLCDATA<MLC5OUT>
extern volatile __bit                   MLC5OUT             __at(0x73BC);	// @ (0xE77 * 8 + 4)
#define                                 MLC5OUT_bit         _BIT_ACCESS(CLCDATA,4)
// CLCDATA<MLC6OUT>
extern volatile __bit                   MLC6OUT             __at(0x73BD);	// @ (0xE77 * 8 + 5)
#define                                 MLC6OUT_bit         _BIT_ACCESS(CLCDATA,5)
// CLCDATA<MLC7OUT>
extern volatile __bit                   MLC7OUT             __at(0x73BE);	// @ (0xE77 * 8 + 6)
#define                                 MLC7OUT_bit         _BIT_ACCESS(CLCDATA,6)
// CLCDATA<MLC8OUT>
extern volatile __bit                   MLC8OUT             __at(0x73BF);	// @ (0xE77 * 8 + 7)
#define                                 MLC8OUT_bit         _BIT_ACCESS(CLCDATA,7)
// SSP1ADD<MSK01>
extern volatile __bit                   MSK01               __at(0x7C90);	// @ (0xF92 * 8 + 0)
#define                                 MSK01_bit           _BIT_ACCESS(SSP1ADD,0)
// SSP2ADD<MSK02>
extern volatile __bit                   MSK02               __at(0x7470);	// @ (0xE8E * 8 + 0)
#define                                 MSK02_bit           _BIT_ACCESS(SSP2ADD,0)
// SSP1ADD<MSK11>
extern volatile __bit                   MSK11               __at(0x7C91);	// @ (0xF92 * 8 + 1)
#define                                 MSK11_bit           _BIT_ACCESS(SSP1ADD,1)
// SSP2ADD<MSK12>
extern volatile __bit                   MSK12               __at(0x7471);	// @ (0xE8E * 8 + 1)
#define                                 MSK12_bit           _BIT_ACCESS(SSP2ADD,1)
// SSP1ADD<MSK21>
extern volatile __bit                   MSK21               __at(0x7C92);	// @ (0xF92 * 8 + 2)
#define                                 MSK21_bit           _BIT_ACCESS(SSP1ADD,2)
// SSP2ADD<MSK22>
extern volatile __bit                   MSK22               __at(0x7472);	// @ (0xE8E * 8 + 2)
#define                                 MSK22_bit           _BIT_ACCESS(SSP2ADD,2)
// SSP1ADD<MSK31>
extern volatile __bit                   MSK31               __at(0x7C93);	// @ (0xF92 * 8 + 3)
#define                                 MSK31_bit           _BIT_ACCESS(SSP1ADD,3)
// SSP2ADD<MSK32>
extern volatile __bit                   MSK32               __at(0x7473);	// @ (0xE8E * 8 + 3)
#define                                 MSK32_bit           _BIT_ACCESS(SSP2ADD,3)
// SSP1ADD<MSK41>
extern volatile __bit                   MSK41               __at(0x7C94);	// @ (0xF92 * 8 + 4)
#define                                 MSK41_bit           _BIT_ACCESS(SSP1ADD,4)
// SSP2ADD<MSK42>
extern volatile __bit                   MSK42               __at(0x7474);	// @ (0xE8E * 8 + 4)
#define                                 MSK42_bit           _BIT_ACCESS(SSP2ADD,4)
// SSP1ADD<MSK51>
extern volatile __bit                   MSK51               __at(0x7C95);	// @ (0xF92 * 8 + 5)
#define                                 MSK51_bit           _BIT_ACCESS(SSP1ADD,5)
// SSP2ADD<MSK52>
extern volatile __bit                   MSK52               __at(0x7475);	// @ (0xE8E * 8 + 5)
#define                                 MSK52_bit           _BIT_ACCESS(SSP2ADD,5)
// SSP1ADD<MSK61>
extern volatile __bit                   MSK61               __at(0x7C96);	// @ (0xF92 * 8 + 6)
#define                                 MSK61_bit           _BIT_ACCESS(SSP1ADD,6)
// SSP2ADD<MSK62>
extern volatile __bit                   MSK62               __at(0x7476);	// @ (0xE8E * 8 + 6)
#define                                 MSK62_bit           _BIT_ACCESS(SSP2ADD,6)
// SSP1ADD<MSK71>
extern volatile __bit                   MSK71               __at(0x7C97);	// @ (0xF92 * 8 + 7)
#define                                 MSK71_bit           _BIT_ACCESS(SSP1ADD,7)
// SSP2ADD<MSK72>
extern volatile __bit                   MSK72               __at(0x7477);	// @ (0xE8E * 8 + 7)
#define                                 MSK72_bit           _BIT_ACCESS(SSP2ADD,7)
// PMD4<MSSP1MD>
extern volatile __bit                   MSSP1MD             __at(0x7704);	// @ (0xEE0 * 8 + 4)
#define                                 MSSP1MD_bit         _BIT_ACCESS(PMD4,4)
// PMD4<MSSP2MD>
extern volatile __bit                   MSSP2MD             __at(0x7705);	// @ (0xEE0 * 8 + 5)
#define                                 MSSP2MD_bit         _BIT_ACCESS(PMD4,5)
// OSCCON1<NDIV0>
extern volatile __bit                   NDIV0               __at(0x7698);	// @ (0xED3 * 8 + 0)
#define                                 NDIV0_bit           _BIT_ACCESS(OSCCON1,0)
// OSCCON1<NDIV1>
extern volatile __bit                   NDIV1               __at(0x7699);	// @ (0xED3 * 8 + 1)
#define                                 NDIV1_bit           _BIT_ACCESS(OSCCON1,1)
// OSCCON1<NDIV2>
extern volatile __bit                   NDIV2               __at(0x769A);	// @ (0xED3 * 8 + 2)
#define                                 NDIV2_bit           _BIT_ACCESS(OSCCON1,2)
// OSCCON1<NDIV3>
extern volatile __bit                   NDIV3               __at(0x769B);	// @ (0xED3 * 8 + 3)
#define                                 NDIV3_bit           _BIT_ACCESS(OSCCON1,3)
// OSCCON1<NOSC0>
extern volatile __bit                   NOSC0               __at(0x769C);	// @ (0xED3 * 8 + 4)
#define                                 NOSC0_bit           _BIT_ACCESS(OSCCON1,4)
// OSCCON1<NOSC1>
extern volatile __bit                   NOSC1               __at(0x769D);	// @ (0xED3 * 8 + 5)
#define                                 NOSC1_bit           _BIT_ACCESS(OSCCON1,5)
// OSCCON1<NOSC2>
extern volatile __bit                   NOSC2               __at(0x769E);	// @ (0xED3 * 8 + 6)
#define                                 NOSC2_bit           _BIT_ACCESS(OSCCON1,6)
// OSCCON3<NOSCR>
extern volatile __bit                   NOSCR               __at(0x76AB);	// @ (0xED5 * 8 + 3)
#define                                 NOSCR_bit           _BIT_ACCESS(OSCCON3,3)
// SSP1STAT<NOT_ADDRESS1>
extern volatile __bit                   NOT_ADDRESS1        __at(0x7CA5);	// @ (0xF94 * 8 + 5)
#define                                 NOT_ADDRESS1_bit    _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<NOT_ADDRESS2>
